<template>
  <div>
    <div :id="id" class="provinceCharts"></div>
    <button class="back" @click="goBack()">返回</button>
  </div>
</template>

<script>
export default {
  name: 'province',
  data () {
    return {
      id: 'echarts_' + new Date().getTime() + Math.floor(Math.random() * 1000),
      echartObj: null,
      option: {
        title: {
          text: '',
          top: '8%',
          left: '8%',
          textStyle: {
            fontSize: 14,
            fontWeight: 300,
            color: '#000'
          }
        },
        tooltip: {
          padding: 0,
          // 数据格式化
          formatter: function (params, callback) {
            var hangzhou = [
              "<strong>"+"<br>"+'浙江大学',
              "<br>"+'杭州电子科技大学',
              "<br>"+'浙江工业大学',
              "<br>"+'浙江理工大学',
              "<br>"+'浙江农林大学',
            ]
            var pudongxinqu = [
              "<strong>"+"<br>"+'复旦大学（张江校区）',
              "<br>"+'上海立信会计金融学院（上川路校区）',
              "<br>"+'上海海事大学（临港校区）',
              "<br>"+'上海海事大学（港湾校区）',
              "<br>"+'上海电力大学（港湾校区）',
              "<br>"+'上海健康医学院（浦东校区）',
              "<br>"+'上海海洋大学（临港校区）',
              "<br>"+'上海中医药大学',
              "<br>"+'上海海关学院',
              "<br>"+'上海戏剧学院（浦东校区）',
              "<br>"+'上海公安学院',
              "<br>"+'上海电机学院（临港校区）',
              "<br>"+'上海杉达学院（金海校区）',
              "<br>"+'上海第二工业大学（金海路校区）',
              "<br>"+'上海建桥学院',
              "<br>"+'上海兴伟学院',
              "<br>"+'上海科技大学',
              "<br>"+'上海纽约大学',
              "<br>"+'上海交通职业技术学院（浦东校区）',
              "<br>"+'上海海事职业技术学院',
              "<br>"+'上海民远职业技术学院',
              "<br>"+'上海思博职业技术学院',
              "<br>"+'上海工商外国语职业学院',
              "<br>"+'上海电影艺术职业学院',
              "<br>"+'上海民航职业技术学院（浦东校区）'
            ]
            var chongming = [
              "<strong>"+"<br>"+'上海外国语大学贤达经济人文学院'
            ]
            var jinshan = [
              "<strong>"+"<br>"+'华东理工大学（金山科技园区）',
              "<br>"+'上海中侨职业技术大学（金山校区）'
            ]
            var fengxian = [
              "<strong>"+"<br>"+'华东理工大学（奉贤校区）',
              "<br>"+'上海应用技术大学（奉贤校区）',
              "<br>"+'上海师范大学（奉贤校区）',
              "<br>"+'上海商学院（奉贤校区）',
              "<br>"+'上海旅游高等专科学校',
              "<br>"+'上海城健职业学院（奉贤校区）',
              "<br>"+'上海电子信息职业技术学院（奉贤校区）',
              "<br>"+'上海欧华职业技术学院',
              "<br>"+'上海工会管理职业学院'
            ]
            var songjiang = [
              "<strong>"+"<br>"+'上海立信会计金融学院（文翔路校区）',
              "<br>"+'东华大学（松江校区）',
              "<br>"+'上海外国语大学（松江校区）',
              "<br>"+'上海对外经贸大学（松江校区）',
              "<br>"+'华东政法大学（松江校区）',
              "<br>"+'上海工程技术大学（松江校区）',
              "<br>"+'上海立达学院',
              "<br>"+'上海视觉艺术学院',
              "<br>"+'上海农林职业技术学院'
            ]
            var qingpu = [
              "<strong>"+"<br>"+'上海政法学院',
              "<br>"+'上海工商职业技术学院（青浦校区）'
            ]
            var jiading = [
              "<strong>"+"<br>"+'同济大学（嘉定校区）',
              "<br>"+'上海大学（嘉定校区）',
              "<br>"+'上海师范大学天华学院',
              "<br>"+'上海工商职业技术学院',
              "<br>"+'上海交通职业技术学院（嘉定校区）',
              "<br>"+'上海工艺美术职业学院',
              "<br>"+'上海科学技术职业学院'
            ]
            var baoshan = [
              "<strong>"+"<br>"+'上海大学（宝山校区）',
              "<br>"+'上海第二工业大学（宝山校区）',
              "<br>"+'上海城健职业学院（宝山校区）',
              "<br>"+'上海交通职业技术学院（宝山校区）',
              "<br>"+'上海海事职业技术学院（宝山校区）',
              "<br>"+'上海震旦职业学院',
              "<br>"+'上海济光职业技术学院',
              "<br>"+'上海邦德职业技术学院'
            ]
            var minhang = [
              "<strong>"+"<br>"+'上海交通大学（闵行校区）',
              "<br>"+'华东师范大学（闵行校区）',
              "<br>"+'上海戏剧学院（莲花路校区）',
              "<br>"+'上海戏剧学院（昌林路校区）',
              "<br>"+'上海电机学院（闵行校区）',
              "<br>"+'上海东海职业技术学院',
              "<br>"+'上海城健职业学院',
              "<br>"+'上海交通职业技术学院（轨道交通学院）',
              "<br>"+'上海电子信息职业技术学院（闵行校区）'
            ]
            var xuhui = [
              "<strong>"+"<br>"+'复旦大学（枫林校区）',
              "<br>"+'上海立信会计金融学院（中山西路路校区）',
              "<br>"+'上海交通大学（徐汇校区）',
              "<br>"+'华东理工大学（徐汇校区）',
              "<br>"+'上海理工大学（复兴路校区）',
              "<br>"+'上海应用技术大学（徐汇校区）',
              "<br>"+'上海应用技术大学（梅陇校区）',
              "<br>"+'上海健康医学院（徐汇校区）',
              "<br>"+'上海师范大学（徐汇校区）',
              "<br>"+'上海体育学院（徐汇校区）',
              "<br>"+'上海音乐学院',
              "<br>"+'上海音乐学院（零陵路校区）',
              "<br>"+'上海第二工业大学（徐汇校区）',
              "<br>"+'上海商学院',
              "<br>"+'上海科技大学（岳阳路校区）',
              "<br>"+'上海电子信息职业技术学院（徐汇校区）',
              "<br>"+'上海工艺美术职业学院',
              "<br>"+'上海民航职业技术学院'
            ]
            var changning = [
              "<strong>"+"<br>"+'东华大学（延安路校区）',
              "<br>"+'华东师范大学（古北路校区）',
              "<br>"+'上海对外经贸大学（古北校区）',
              "<br>"+'华东政法大学（长宁校区）',
              "<br>"+'上海戏剧学院（虹桥校区）',
              "<br>"+'上海工程技术大学（长宁校区）'
            ]
            var putuo = [
              "<strong>"+"<br>"+'同济大学（沪西校区）',
              "<br>"+'华东师范大学（中北校区）',
              "<br>"+'上海电子信息职业技术学院（新村路校区）'
            ]
            var jingan = [
              "<strong>"+"<br>"+'同济大学（沪北校区）',
              "<br>"+'上海戏剧学院（华山路校区）',
              "<br>"+'上海大学（延长校区）',
              "<br>"+'上海商学院',
              "<br>"+'上海行健职业学院（原平路分校）',
              "<br>"+'上海城健职业学院（原平路分校）'
            ]
            var huangpu = [
              "<strong>"+"<br>"+'上海交通大学（黄浦校区）',
              "<br>"+'上海中华职业技术学院'
            ]
            var hongkou = [
              "<strong>"+"<br>"+'上海海事大学（虹口校区）',
              "<br>"+'上海师范大学（虹口校区）',
              "<br>"+'上海外国语大学（虹口校区）',
              "<br>"+'上海财经大学（中山北一路校区）',
              "<br>"+'上海财经大学（昆山路校区）',
              "<br>"+'上海工程技术大学（逸仙路校区）',
              "<br>"+'上海外国语大学贤达经济人文学院（虹口校区）',
              "<br>"+'上海工会管理职业学院',
              "<br>"+'上海南湖职业技术学院'
            ]
            var yangpu = [
              "<strong>"+"<br>"+'复旦大学（邯郸校区）',
              "<br>"+'复旦大学（江湾新校区）',
              "<br>"+'同济大学',
              "<br>"+'上海理工大学',
              "<br>"+'上海电力大学（杨浦校区）',
              "<br>"+'上海海洋大学（军工路校区）',
              "<br>"+'上海财经大学（国定路校区）',
              "<br>"+'上海财经大学（武东路校区）',
              "<br>"+'上海体育学院',
              "<br>"+'上海出版印刷高等专科学校（水丰路校区）',
              "<br>"+'上海出版印刷高等专科学校（营口路校区）',
              "<br>"+'上海出版印刷高等专科学校（国顺东路校区）',
              "<br>"+'上海城健职业学院（杨浦校区）',
              "<br>"+'上海海事职业技术学院（杨浦校区）',
              "<br>"+'上海工会管理职业学院'
            ]
            var anhui = [
              "<br>"+'安徽大学',
              "<br>"+'中国科学技术大学',
              "<br>"+'合肥工业大学',
              "<br>"+'安徽农业大学',
              "<br>"+'安徽医科大学',
              "<br>"+'安徽中医药大学',
              "<br>"+'巢湖学院',
              "<br>"+'安徽建筑大学',
              "<br>"+'安徽三联学院',
              "<br>"+'合肥学院',
              "<br>"+'安徽新华学院',
              "<br>"+'安徽文达信息工程学院',
              "<br>"+'安徽外国语学院',
              "<br>"+'安徽大学江淮学院',
              "<br>"+'安徽建筑大学城市建设学院',
              "<br>"+'安徽农业大学经济技术学院',
              "<br>"+'安徽医科大学临床医学院',
              "<br>"+'合肥师范学院',
              "<br>"+'安徽职业技术学院',
              "<br>"+'安徽水利水电职业技术学院',
              "<br>"+'民办万博科技职业学院',
              "<br>"+'安徽警官职业学院',
              "<br>"+'安徽工业经济职业技术学院',
              "<br>"+'合肥通用职业技术学院',
              "<br>"+'民办合肥经济技术职业学院',
              "<br>"+'安徽交通职业技术学院',
              "<br>"+'安徽体育运动职业技术学院',
              "<br>"+'安徽医学高等专科学校',
              "<br>"+'合肥职业技术学院',
              "<br>"+'安徽广播影视职业技术学院',
              "<br>"+'民办合肥滨湖职业技术学院',
              "<br>"+'安徽电气工程职业技术学院',
              "<br>"+'安徽城市管理职业学院',
              "<br>"+'安徽工商职业学院',
              "<br>"+'安徽中澳科技职业学院"',
              "<br>"+'安徽艺术职业学院"',
              "<br>"+'安徽财贸职业学院',
              "<br>"+'安徽国际商务职业学院',
              "<br>"+'安徽公安职业学院',
              "<br>"+'安徽林业职业技术学院',
              "<br>"+'安徽审计职业学院',
              "<br>"+'安徽新闻出版职业技术学院',
              "<br>"+'安徽邮电职业技术学院',
              "<br>"+'民办合肥财经职业学院',
              "<br>"+'安徽涉外经济职业学院',
              "<br>"+'安徽绿海商务职业学院',
              "<br>"+'合肥共达职业技术学院',
              "<br>"+'徽商职业学院',
              "<br>"+'合肥信息技术职业学院',
              "<br>"+'安徽汽车职业技术学院',
              "<br>"+'合肥幼儿师范高等专科学校',
              "<br>"+'安徽长江职业学院',
              "<br>"+'安徽粮食工程职业学院',
              "<br>"+'合肥科技职业学院',
              "<br>"+'中国人民解放军陆军炮兵防空兵学院'
            ]
            var bozhou = [
              "<strong>"+"<br>"+'亳州学院',
              "<br>"+'亳州职业技术学院'
            ]
            var fuyang = [
              "<strong>"+"<br>"+'阜阳师范大学',
              "<br>"+'阜阳师范学院信息工程学院',
              "<br>"+'阜阳职业技术学院',
              "<br>"+'阜阳科技职业学院',
              "<br>"+'民办安徽旅游职业学院',
              "<br>"+'阜阳幼儿师范高等专科学校'
            ]
            var suzhou = [
              "<strong>"+"<br>"+'宿州学院',
              "<br>"+'宿州职业技术学院',
              "<br>"+'皖北卫生职业学院'
            ]
            var huaibei = [
              "<strong>"+"<br>"+'淮北师范大学',
              "<br>"+'淮北师范大学信息学院',
              "<br>"+'淮北职业技术学院',
              "<br>"+'安徽矿业职业技术学院'
            ]
            var bengbu = [
              "<strong>"+"<br>"+'蚌埠医学院',
              "<br>"+'安徽财经大学',
              "<br>"+'蚌埠学院',
              "<br>"+'安徽财经大学商学院',
              "<br>"+'安徽电子信息职业技术学院',
              "<br>"+'蚌埠经济技术职业学院',
              "<br>"+'中国人民解放军海军士官学校'
            ]
            var huainan = [
              "<strong>"+"<br>"+'安徽理工大学',
              "<br>"+'淮南师范学院',
              "<br>"+'淮南联合大学',
              "<br>"+'淮南职业技术学院',
              "<br>"+'安徽工贸职业技术学院'
            ]
            var liuan = [
              "<strong>"+"<br>"+'皖西学院',
              "<br>"+'六安职业技术学院',
              "<br>"+'安徽国防科技职业学院',
              "<br>"+'安徽现代信息工程职业学院',
              "<br>"+'皖西卫生职业学院'
            ]
            var anqing = [
              "<strong>"+"<br>"+'安庆师范大学',
              "<br>"+'安庆职业技术学院',
              "<br>"+'安庆医药高等专科学校',
              "<br>"+'桐城师范高等专科学校',
              "<br>"+'安徽黄梅戏艺术职业学院'
            ]
            var chizhou = [
              "<strong>"+"<br>"+'池州学院',
              "<br>"+'池州职业技术学院',
              "<br>"+'安徽卫生健康职业学院'
            ]
            var huangshan = [
              "<strong>"+"<br>"+'黄山学院',
              "<br>"+'黄山职业技术学院'
            ]
            var tongling = [
              "<strong>"+"<br>"+'铜陵学院',
              "<br>"+'铜陵职业技术学院',
              "<br>"+'安徽工业职业技术学院'
            ]
            var xuancheng = [
              "<strong>"+"<br>"+'宣城职业技术学院'
            ]
            var wuhu = [
              "<strong>"+"<br>"+'安徽工程大学',
              "<br>"+'皖南医学院',
              "<br>"+'安徽师范大学',
              "<br>"+'安徽信息工程学院',
              "<br>"+'安徽师范大学皖江学院',
              "<br>"+'芜湖职业技术学院',
              "<br>"+'安徽商贸职业技术学院',
              "<br>"+'安徽中医药高等专科学校',
              "<br>"+'安徽机电职业技术学院',
              "<br>"+'安徽扬子职业技术学院'
            ]
            var maanshan = [
              "<strong>"+"<br>"+'安徽工业大学',
              "<br>"+'安徽工业大学工商学院',
              "<br>"+'河海大学文天学院',
              "<br>"+'安徽冶金科技职业学院',
              "<br>"+'马鞍山师范高等专科学校',
              "<br>"+'马鞍山职业技术学院'
            ]
            var chuzhou = [
              "<strong>"+"<br>"+'滁州学院',
              "<br>"+'安徽科技学院',
              "<br>"+'滁州职业技术学院',
              "<br>"+'滁州城市职业学院'
            ]
            var jiaxin = [
              "<strong>"+"<br>"+'嘉兴学院',
              "<br>"+'嘉兴学院南湖学院',
              "<br>"+'浙江财经大学东方学院',
              "<br>"+'同济大学浙江学院',
              "<br>"+'嘉兴职业技术学院',
              "<br>"+'嘉兴南洋职业技术学院'
            ]
            var zhoushan = [
              "<strong>"+"<br>"+'浙江海洋大学',
              "<br>"+'浙江海洋大学东海科学技术学院',
              "<br>"+'浙江国际海运职业技术学院',
              "<br>"+'浙江舟山群岛新区旅游与健康职业学院'
            ]
            var ningbo = [
              "<strong>"+"<br>"+'公安海警学院',
              "<br>"+'浙江万里学院',
              "<br>"+'宁波工程学院',
              "<br>"+'宁波大学',
              "<br>"+'宁波大红鹰学院',
              "<br>"+'浙江大学宁波理工学院',
              "<br>"+'宁波大学科学技术学院',
              "<br>"+'宁波诺丁汉大学',
              "<br>"+'宁波职业技术学院',
              "<br>"+'宁波城市职业技术学院',
              "<br>"+'浙江工商职业技术学院',
              "<br>"+'浙江医药高等专科学校',
              "<br>"+'浙江纺织服装职业技术学院',
              "<br>"+'宁波卫生职业技术学院'
            ]
            var shaoxing = [
              "<strong>"+"<br>"+'绍兴文理学院',
              "<br>"+'浙江越秀外国语学院',
              "<br>"+'浙江农林大学暨阳学院',
              "<br>"+'绍兴文理学院元培学院',
              "<br>"+'浙江工业职业技术学院',
              "<br>"+'绍兴职业技术学院',
              "<br>"+'浙江邮电职业技术学院',
              "<br>"+'浙江农业商贸职业学院'
            ]
            var hangzhou = [
              "<strong>"+"<br>"+'浙江大学',
              "<br>"+'杭州电子科技大学',
              "<br>"+'浙江工业大学',
              "<br>"+'浙江理工大学',
              "<br>"+'浙江农林大学',
              "<br>"+'浙江中医药大学',
              "<br>"+'杭州师范大学',
              "<br>"+'浙江工商大学',
              "<br>"+'中国美术学院',
              "<br>"+'中国计量大学',
              "<br>"+'浙江科技学院',
              "<br>"+'浙江水利水电学院',
              "<br>"+'浙江财经大学',
              "<br>"+'浙江警察学院',
              "<br>"+'浙江传媒学院',
              "<br>"+'浙江树人学院',
              "<br>"+'浙江大学城市学院',
              "<br>"+'杭州电子科技大学信息工程学院',
              "<br>"+'浙江工商大学杭州商学院',
              "<br>"+'浙江交通职业技术学院',
              "<br>"+'浙江电力职业技术学院',
              "<br>"+'浙江建设职业技术学院',
              "<br>"+'浙江经贸职业技术学院',
              "<br>"+'浙江经济职业技术学院',
              "<br>"+'浙江警官职业学院',
              "<br>"+'杭州职业技术学院',
              "<br>"+'浙江特殊教育职业学院',
              "<br>"+'浙江音乐学院'
            ]
            var jinhua = [
              "<strong>"+"<br>"+'浙江师范大学',
              "<br>"+'浙江师范大学行知学院',
              "<br>"+'上海财经大学浙江学院',
              "<br>"+'金华职业技术学院',
              "<br>"+'义乌工商职业技术学院',
              "<br>"+'浙江广厦建设职业技术学院',
              "<br>"+'浙江横店影视职业学院'
            ]
            var lishui = [
              "<strong>"+"<br>"+'丽水学院',
              "<br>"+'丽水职业技术学院',
            ]
            var wenzhou = [
              "<strong>"+"<br>"+'温州医科大学',
              "<br>"+'温州大学',
              "<br>"+'温州医科大学仁济学院',
              "<br>"+'温州商学院',
              "<br>"+'温州肯恩大学',
              "<br>"+'温州职业技术学院',
              "<br>"+'浙江工贸职业技术学院',
              "<br>"+'浙江东方职业技术学院',
              "<br>"+'温州科技职业学院',
              "<br>"+'浙江安防职业技术学院'
            ]
            var taizhou = [
              "<strong>"+"<br>"+'台州学院',
              "<br>"+'台州职业技术学院',
              "<br>"+'台州科技职业学院',
              "<br>"+'浙江汽车职业技术学院'
            ]
            var quzhou = [
              "<strong>"+"<br>"+'衢州学院',
              "<br>"+'衢州职业技术学院'
            ]
            var xuzhou = [
              "<strong>"+"<br>"+'中国矿业大学',
              "<br>"+'徐州医科大学',
              "<br>"+'江苏师范大学',
              "<br>"+'徐州工程学院',
              "<br>"+'中国矿业大学徐海学院',
              "<br>"+'江苏师范大学科文学院',
              "<br>"+'江苏建筑职业技术学院',
              "<br>"+'九州职业技术学院',
              "<br>"+'徐州工业职业技术学院',
              "<br>"+'徐州幼儿师范高等专科学校',
              "<br>"+'徐州生物工程职业技术学院',
              "<br>"+'江苏安全技术职业学院'
            ]
            var  lianyungang= [
              "<strong>"+"<br>"+'淮海工学院',
              "<br>"+'南京医科大学康达学院',
              "<br>"+'连云港职业技术学院',
              "<br>"+'连云港师范高等专科学校',
              "<br>"+'江苏财会职业学院'
            ]
            var huaian= [
              "<strong>"+"<br>"+'淮阴师范学院',
              "<br>"+'淮阴工学院',
              "<br>"+'淮安信息职业技术学院',
              "<br>"+'炎黄职业技术学院',
              "<br>"+'江苏食品药品职业技术学院',
              "<br>"+'江苏财经职业技术学院',
              "<br>"+'江苏护理职业学院'
            ]
            var suqian = [
              "<strong>"+"<br>"+'宿迁学院',
              "<br>"+'宿迁职业技术学院',
              "<br>"+'宿迁泽达职业技术学院'
            ]
            var  yancheng= [
              "<strong>"+"<br>"+'盐城工学院',
              "<br>"+'盐城师范学院',
              "<br>"+'明达职业技术学院',
              "<br>"+'江苏医药职业学院',
              "<br>"+'盐城工业职业技术学院',
              "<br>"+'盐城幼儿师范高等专科学校'
            ]
            var taizhou2 = [
              "<strong>"+"<br>"+'泰州学院',
              "<br>"+'南京理工大学泰州科技学院',
              "<br>"+'南京师范大学泰州学院',
              "<br>"+'南京中医药大学翰林学院',
              "<br>"+'常州大学怀德学院',
              "<br>"+'泰州职业技术学院',
              "<br>"+'江苏农牧科技职业学院'
            ]
            var nanjin = [
              "<strong>"+"<br>"+'南京大学',
              "<br>"+'东南大学',
              "<br>"+'南京航空航天大学',
              "<br>"+'南京理工大学',
              "<br>"+'南京工业大学',
              "<br>"+'南京邮电大学',
              "<br>"+'河海大学',
              "<br>"+'南京林业大学',
              "<br>"+'南京信息工程大学',
              "<br>"+'南京农业大学',
              "<br>"+'南京医科大学',
              "<br>"+'南京中医药大学',
              "<br>"+'中国药科大学',
              "<br>"+'南京师范大学',
              "<br>"+'南京财经大学',
              "<br>"+'江苏警官学院',
              "<br>"+'南京体育学院',
              "<br>"+'南京审计大学',
              "<br>"+'南京特殊教育师范学院',
              "<br>"+'金陵科技学院',
              "<br>"+'中国传媒大学南广学院'
            ]
            var changzhou = [
              "<strong>"+"<br>"+'常州大学',
              "<br>"+'常州工学院',
              "<br>"+'江苏理工学院',
              "<br>"+'常州信息职业技术学院',
              "<br>"+'常州纺织服装职业技术学院',
              "<br>"+'常州轻工职业技术学院',
              "<br>"+'常州工程职业技术学院',
              "<br>"+'建东职业技术学院',
              "<br>"+'常州机电职业技术学院',
              "<br>"+'江苏城乡建设职业学院'
            ]
            var zhengjiang = [
              "<strong>"+"<br>"+'江苏科技大学',
              "<br>"+'江苏大学',
              "<br>"+'江苏大学京江学院',
              "<br>"+'南京财经大学红山学院',
              "<br>"+'镇江市高等专科学校',
              "<br>"+'江苏农林职业技术学院',
              "<br>"+'金山职业技术学院',
              "<br>"+'江苏航空职业技术学院'
            ]
            var nantong = [
              "<strong>"+"<br>"+'南通大学',
              "<br>"+'南通理工学院',
              "<br>"+'南通大学杏林学院',
              "<br>"+'江苏工程职业技术学院',
              "<br>"+'南通职业大学',
              "<br>"+'南通科技职业学院',
              "<br>"+'南通航运职业技术学院',
              "<br>"+'江苏商贸职业学院',
              "<br>"+'南通师范高等专科学校'
            ]
            var wuxi = [
              "<strong>"+"<br>"+'江南大学',
              "<br>"+'无锡太湖学院',
              "<br>"+'无锡职业技术学院',
              "<br>"+'无锡科技职业学院',
              "<br>"+'无锡商业职业技术学院',
              "<br>"+'太湖创意职业技术学院',
              "<br>"+'无锡南洋职业技术学院',
              "<br>"+'江南影视艺术职业学院',
              "<br>"+'江苏信息职业技术学院',
              "<br>"+'江阴职业技术学院',
              "<br>"+'无锡城市职业技术学院',
              "<br>"+'无锡工艺职业技术学院'
            ]
            var suzhou = [
              "<strong>"+"<br>"+'苏州大学',
              "<br>"+'苏州科技大学',
              "<br>"+'常熟理工学院',
              "<br>"+'苏州大学文正学院',
              "<br>"+'苏州大学应用技术学院',
              "<br>"+'苏州科技大学天平学院',
              "<br>"+'西交利物浦大学',
              "<br>"+'苏州工艺美术职业技术学院',
              "<br>"+'苏州职业大学',
              "<br>"+'沙洲职业工学院',
              "<br>"+'硅湖职业技术学院',
              "<br>"+'苏州经贸职业技术学院',
              "<br>"+'苏州工业职业技术学院',
              "<br>"+'苏州托普信息职业技术学院',
              "<br>"+'苏州卫生职业技术学院',
              "<br>"+'苏州信息职业技术学院',
              "<br>"+'苏州高博软件技术职业学院'
            ]
            var yangzhou = [
              "<strong>"+"<br>"+'扬州大学',
              "<br>"+'扬州大学广陵学院',
              "<br>"+'南京邮电大学通达学院',
              "<br>"+'扬州市职业大学',
              "<br>"+'扬州环境资源职业技术学院',
              "<br>"+'江海职业技术学院',
              "<br>"+'扬州工业职业技术学院',
              "<br>"+'扬州中瑞酒店职业学院',
              "<br>"+'江苏旅游职业学院'
            ]
            var nanpin = [
              "<strong>"+"<br>"+'武夷学院',
              "<br>"+'福建林业职业技术学院',
              "<br>"+'闽北职业技术学院',
              "<br>"+'武夷山职业学院'
            ]
            var ningde = [
              "<strong>"+"<br>"+'宁德师范学院',
              "<br>"+'宁德职业技术学院'
            ]
            var fuzhou = [
              "<strong>"+"<br>"+'福州大学',
              "<br>"+'福建工程学院',
              "<br>"+'福建农林大学',
              "<br>"+'福建医科大学',
              "<br>"+'福建中医药大学',
              "<br>"+'福建师范大学',
              "<br>"+'闽江学院',
              "<br>"+'福建警察学院',
              "<br>"+'福建农林大学东方学院',
              "<br>"+'福州大学至诚学院',
              "<br>"+'福建师范大学协和学院',
              "<br>"+'福州外语外贸学院',
              "<br>"+'福建江夏学院',
              "<br>"+'福州理工学院',
              "<br>"+'福建农林大学金山学院',
              "<br>"+'福建船政交通职业学院',
              "<br>"+'福建商学院',
              "<br>"+'福建华南女子职业学院',
              "<br>"+'福州职业技术学院',
              "<br>"+'福建信息职业技术学院',
              "<br>"+'福建农业职业技术学院',
              "<br>"+'福建卫生职业技术学院',
              "<br>"+'福州英华职业学院',
              "<br>"+'福州软件职业技术学院',
              "<br>"+'福建幼儿师范高等专科学校',
              "<br>"+'福建艺术职业学院'
            ]
            var sanming = [
              "<strong>"+"<br>"+'三明学院',
              "<br>"+'福建水利电力职业技术学院',
              "<br>"+'三明医学科技职业学院'
            ]
            var putian = [
              "<strong>"+"<br>"+'莆田学院',
              "<br>"+'湄洲湾职业技术学院'
            ]
            var quanzhou = [
              "<strong>"+"<br>"+'华侨大学',
              "<br>"+'泉州师范学院',
              "<br>"+'仰恩大学',
              "<br>"+'闽南理工学院',
              "<br>"+'福建师范大学闽南科技学院',
              "<br>"+'泉州信息工程学院',
              "<br>"+'黎明职业大学',
              "<br>"+'福建电力职业技术学院',
              "<br>"+'泉州医学高等专科学校',
              "<br>"+'泉州纺织服装职业学院',
              "<br>"+'泉州华光职业学院',
              "<br>"+'泉州经贸职业技术学院'
            ]
            var xiamen = [
              "<strong>"+"<br>"+'厦门大学',
              "<br>"+'集美大学',
              "<br>"+'厦门理工学院',
              "<br>"+'厦门华厦学院',
              "<br>"+'厦门工学院',
              "<br>"+'集美大学诚毅学院',
              "<br>"+'厦门海洋职业技术学院',
              "<br>"+'厦门医学院',
              "<br>"+'厦门演艺职业学院',
              "<br>"+'厦门华天涉外职业技术学院',
              "<br>"+'厦门城市职业学院',
              "<br>"+'厦门兴才职业技术学院',
              "<br>"+'厦门软件职业技术学院',
              "<br>"+'厦门南洋职业学院',
              "<br>"+'厦门东海职业技术学院',
              "<br>"+'厦门安防科技职业学院'
            ]
            var longyan = [
              "<strong>"+"<br>"+'龙岩学院',
              "<br>"+'闽西职业技术学院'
            ]
            var zhangzhou = [
              "<strong>"+"<br>"+'闽南师范大学',
              "<br>"+'厦门大学嘉庚学院',
              "<br>"+'漳州职业技术学院',
              "<br>"+'漳州城市职业学院',
              "<br>"+'漳州科技职业学院',
              "<br>"+'漳州理工职业学院',
              "<br>"+'漳州卫生职业学院'
            ]

            var guangzhou = [
              "<strong>"+"<br>"+'中山大学',
              "<br>"+'暨南大学',
              "<br>"+'广东轻工职业技术学院',
              "<br>"+'华南理工大学',
              "<br>"+'华南农业大学',
              "<br>"+'广东交通职业技术学院',
              "<br>"+'广州医科大学',
              "<br>"+'广东水利电力职业技术学院',
              "<br>"+'广州中医药大学',
              "<br>"+'广东药科大学',
              "<br>"+'华南师范大学',
              "<br>"+'广东南华工商职业学院',
              "<br>"+'私立华联学院',
              "<br>"+'广州民航职业技术学院',
              "<br>"+'广东农工商职业技术学院',
              "<br>"+'广东科学技术职业学院',
              "<br>"+'广州康大职业技术学院',
              "<br>"+'广州体育学院',
              "<br>"+'广州美术学院',
              "<br>"+'星海音乐学院',
              "<br>"+'广东技术师范学院',
              "<br>"+'广东体育职业技术学院',
              "<br>"+'广东财经大学',
              "<br>"+'广东白云学院',
              "<br>"+'广州大学',
              "<br>"+'广州航海学院',
              "<br>"+'广东警官学院',
              "<br>"+'仲恺农业工程学院',
              "<br>"+'中山大学新华学院',
              "<br>"+'广东金融学院',
              "<br>"+'广东行政职业学院',
              "<br>"+'广东机电职业技术学院',
              "<br>"+'广东女子职业技术学院',
              "<br>"+'广东工业大学',
              "<br>"+'广东外语外贸大学',
              "<br>"+'广东邮电职业技术学院',
              "<br>"+'广东培正学院',
              "<br>"+'南方医科大学',
              "<br>"+'广东工业大学华立学院',
              "<br>"+'广州商学院',
              "<br>"+'广东工贸职业技术学院',
              "<br>"+'广州工商学院',
              "<br>"+'广东司法警官职业学院',
              "<br>"+'广东第二师范学院'
            ]
            var meizhou = [
              "<strong>"+"<br>"+'嘉应学院'
            ]
            var chaozhou = [
              "<strong>"+"<br>"+'韩山师范学院'
            ]
            var heyuan = [
              "<strong>"+"<br>"+'河源职业技术学院'
            ]
            var jieyang = [
              "<strong>"+"<br>"+'潮汕职业技术学院',
              "<br>"+'揭阳职业技术学院'
            ]
            var shantou = [
              "<strong>"+"<br>"+'汕头大学',
              "<br>"+'汕头职业技术学院',
              "<br>"+'广东以色列理工学院'
            ]
            var qingyuan = [
              "<strong>"+"<br>"+'清远职业技术学院',
              "<br>"+'广东碧桂园职业学院'
            ]
            var huizhou = [
              "<strong>"+"<br>"+'惠州学院',
              "<br>"+'惠州经济职业技术学院',
              "<br>"+'惠州卫生职业技术学院',
              "<br>"+'惠州城市职业学院',
              "<br>"+'惠州工程职业学院'
            ]
            var shanwei = [
              "<strong>"+"<br>"+'汕尾职业技术学院'
            ]
            var donghuan = [
              "<strong>"+"<br>"+'东莞理工学院',
              "<br>"+'广东科技学院',
              "<br>"+'东莞理工学院城市学院',
              "<br>"+'广东亚视演艺职业学院',
              "<br>"+'东莞职业技术学院',
              "<br>"+'广东酒店管理职业技术学院'
            ]
            var zhaoqing = [
              "<strong>"+"<br>"+'肇庆学院',
              "<br>"+'广东理工学院',
              "<br>"+'广东工商职业学院',
              "<br>"+'广东信息工程职业学院'
            ]
            var foshan = [
              "<strong>"+"<br>"+'佛山科学技术学院',
              "<br>"+'广东东软学院',
              "<br>"+'顺德职业技术学院',
              "<br>"+'佛山职业技术学院',
              "<br>"+'广东职业技术学院',
              "<br>"+'广东环境保护工程职业学院'
            ]
            var shenzheng = [
              "<strong>"+"<br>"+'深圳大学',
              "<br>"+'南方科技大学',
              "<br>"+'香港中文大学（深圳）',
              "<br>"+'深圳职业技术学院',
              "<br>"+'广东新安职业技术学院',
              "<br>"+'深圳信息职业技术学院',
              "<br>"+'深圳北理莫斯科大学'
            ]
            var zhongshan = [
              "<strong>"+"<br>"+'电子科技大学中山学院',
              "<br>"+'中山火炬职业技术学院',
              "<br>"+'中山职业技术学院'
            ]
            var zhuhai = [
              "<strong>"+"<br>"+'北京理工大学珠海学院',
              "<br>"+'吉林大学珠海学院',
              "<br>"+'北京师范大学-香港浸会大学联合国际学院',
              "<br>"+'珠海艺术职业学院',
              "<br>"+'珠海城市职业技术学院'
            ]
            var shaoguan = [
              "<strong>"+"<br>"+'韶关学院',
              "<br>"+'广东松山职业技术学院'
            ]
            var yunfu = [
              "<strong>"+"<br>"+'罗定职业技术学院'
            ]
            var jiangmen = [
              "<strong>"+"<br>"+'五邑大学',
              "<br>"+'江门职业技术学院',
              "<br>"+'广东南方职业学院',
              "<br>"+'广东江门中医药职业学院'
            ]
            var yangjiang = [
              "<strong>"+"<br>"+'阳江职业技术学院'
            ]
            var maomin = [
              "<strong>"+"<br>"+'广东石油化工学院',
              "<br>"+'茂名职业技术学院',
              "<br>"+'广东茂名健康职业学院',
              "<br>"+'广东茂名幼儿师范专科学校'
            ]
            var zhanjiang = [
              "<strong>"+"<br>"+'广东海洋大学',
              "<br>"+'广东医科大学',
              "<br>"+'岭南师范学院',
              "<br>"+'广东海洋大学寸金学院',
              "<br>"+'广东文理职业学院',
              "<br>"+'湛江幼儿师范专科学校'
            ]

            var  haikou= [
              "<strong>"+"<br>"+'海南大学',
              "<br>"+'海南医学院',
              "<br>"+'海南师范大学',
              "<br>"+'海口经济学院',
              "<br>"+'海南职业技术学院',
              "<br>"+'海南政法职业学院',
              "<br>"+'琼台师范学院',
              "<br>"+'海南经贸职业技术学院',
              "<br>"+'海南工商职业学院',
              "<br>"+'海南科技职业学院',
              "<br>"+'海南体育职业技术学院'
            ]
            var sanya = [
              "<strong>"+"<br>"+'海南热带海洋学院',
              "<br>"+'三亚学院',
              "<br>"+'三亚城市职业学院',
              "<br>"+'三亚航空旅游职业学院',
              "<br>"+'三亚理工职业学院',
              "<br>"+'三亚中瑞酒店管理职业学院'
            ]
            var wenchang = [
              "<strong>"+"<br>"+'海南外国语职业学院'
            ]
            var qionghai = [
              "<strong>"+"<br>"+'海南软件职业技术学院'
            ]
            var weihai = [
              "<strong>"+"<br>"+'威海职业学院',
              "<br>"+'山东外事翻译职业学院',
              "<br>"+'山东药品食品职业学院',
              "<br>"+'威海海洋职业学院'
            ]
            var qingdao = [
              "<strong>"+"<br>"+'中国海洋大学',
              "<br>"+'中国石油大学（华东）',
              "<br>"+'山东科技大学',
              "<br>"+'青岛科技大学',
              "<br>"+'青岛理工大学琴岛学院',
              "<br>"+'北京电影学院现代创意媒体学院',
              "<br>"+'青岛理工大学',
              "<br>"+'青岛农业大学',
              "<br>"+'青岛滨海学院',
              "<br>"+'青岛大学',
              "<br>"+'青岛恒星科技学院',
              "<br>"+'青岛黄海学院',
              "<br>"+'青岛工学院',
              "<br>"+'青岛职业技术学院',
              "<br>"+'青岛飞洋职业技术学院',
              "<br>"+'山东外贸职业学院',
              "<br>"+'青岛酒店管理职业技术学院',
              "<br>"+'青岛港湾职业技术学院',
              "<br>"+'青岛求实职业技术学院'
            ]
            var yantai = [
              "<strong>"+"<br>"+'烟台大学文经学院',
              "<br>"+'青岛农业大学海都学院',
              "<br>"+'鲁东大学',
              "<br>"+'烟台大学',
              "<br>"+'山东工商学院',
              "<br>"+'烟台南山学院',
              "<br>"+'烟台职业学院',
              "<br>"+'烟台工程职业技术学院',
              "<br>"+'山东中医药高等专科学校',
              "<br>"+'山东商务职业学院',
              "<br>"+'烟台汽车工程职业学院',
              "<br>"+'山东文化产业职业学院'
            ]
            var weifang = [
              "<strong>"+"<br>"+'潍坊医学院',
              "<br>"+'潍坊学院',
              "<br>"+'潍坊科技学院',
              "<br>"+'潍坊职业学院',
              "<br>"+'山东科技职业学院',
              "<br>"+'山东畜牧兽医职业学院',
              "<br>"+'山东交通职业学院',
              "<br>"+'山东信息职业技术学院',
              "<br>"+'山东经贸职业学院',
              "<br>"+'潍坊护理职业学院',
              "<br>"+'山东海事职业学院',
              "<br>"+'中国人民解放军火箭军士官学校'
            ]
            var rizhao= [
              "<strong>"+"<br>"+'日照职业技术学院',
              "<br>"+'山东水利职业学院',
              "<br>"+'山东外国语职业学院',
              "<br>"+'日照航海工程职业学院'
            ]
            var linyi = [
              "<strong>"+"<br>"+'临沂大学',
              "<br>"+'山东医学高等专科学校',
              "<br>"+'临沂职业学院'
            ]
            var zaozhaung = [
              "<strong>"+"<br>"+'枣庄学院',
              "<br>"+'枣庄科技职业学院',
              "<br>"+'枣庄职业学院'
            ]
            var jinan = [
              "<strong>"+"<br>"+'山东大学',
              "<br>"+'济南大学',
              "<br>"+'山东师范大学历山学院',
              "<br>"+'山东财经大学燕山学院',
              "<br>"+'济南大学泉城学院',
              "<br>"+'山东建筑大学',
              "<br>"+'齐鲁工业大学',
              "<br>"+'山东中医药大学',
              "<br>"+'山东师范大学',
              "<br>"+'山东财经大学',
              "<br>"+'山东体育学院',
              "<br>"+'山东艺术学院',
              "<br>"+'山东工艺美术学院',
              "<br>"+'山东警察学院',
              "<br>"+'山东交通学院',
              "<br>"+'山东女子学院',
              "<br>"+'山东英才学院',
              "<br>"+'山东现代学院',
              "<br>"+'山东协和学院',
              "<br>"+'齐鲁理工学院',
              "<br>"+'山东政法学院',
              "<br>"+'齐鲁师范学院',
              "<br>"+'山东青年政治学院',
              "<br>"+'山东管理学院',
              "<br>"+'山东农业工程学院',
              "<br>"+'山东商业职业技术学院',
              "<br>"+'山东电力高等专科学校',
              "<br>"+'山东职业学院',
              "<br>"+'山东劳动职业技术学院',
              "<br>"+'山东圣翰财贸职业学院',
              "<br>"+'济南职业学院',
              "<br>"+'山东凯文科技职业学院',
              "<br>"+'济南工程职业技术学院',
              "<br>"+'山东电子职业技术学院',
              "<br>"+'山东旅游职业学院',
              "<br>"+'山东杏林科技职业学院',
              "<br>"+'山东司法警官职业学院',
              "<br>"+'山东传媒职业学院',
              "<br>"+'济南幼儿师范高等专科学校',
              "<br>"+'济南护理职业学院',
              "<br>"+'山东艺术设计职业学院',
              "<br>"+'山东特殊教育职业学院'
            ]
            var heze = [
              "<strong>"+"<br>"+'菏泽学院',
              "<br>"+'菏泽医学专科学校',
              "<br>"+'菏泽家政职业学院',
              "<br>"+'菏泽职业学院'
            ]
            var liaocheng= [
              "<strong>"+"<br>"+'聊城大学东昌学院',
              "<br>"+'聊城大学',
              "<br>"+'聊城职业技术学院'
            ]
            var dezhou = [
              "<strong>"+"<br>"+'德州学院',
              "<br>"+'山东华宇工学院',
              "<br>"+'德州科技职业学院',
              "<br>"+'德州职业技术学院'
            ]
            var bingzhou = [
              "<strong>"+"<br>"+'滨州医学院',
              "<br>"+'滨州学院',
              "<br>"+'滨州职业学院'
            ]
            var jining = [
              "<strong>"+"<br>"+'济宁医学院',
              "<br>"+'曲阜师范大学',
              "<br>"+'济宁学院',
              "<br>"+'曲阜远东职业技术学院',
              "<br>"+'济宁职业技术学院',
              "<br>"+'山东理工职业学院'
            ]
            var dongyin = [
              "<strong>"+"<br>"+'中国石油大学胜利学院',
              "<br>"+'东营职业学院',
              "<br>"+'东营科技职业学院',
              "<br>"+'山东胜利职业学院'
            ]
            var zibo = [
              "<strong>"+"<br>"+'山东理工大学',
              "<br>"+'齐鲁医药学院',
              "<br>"+'淄博职业学院',
              "<br>"+'山东工业职业学院',
              "<br>"+'山东化工职业学院',
              "<br>"+'淄博师范高等专科学校',
              "<br>"+'山东铝业职业学院',
              "<br>"+'山东轻工职业学院'
            ]
            var taian = [
              "<strong>"+"<br>"+'山东科技大学泰山科技学院',
              "<br>"+'山东财经大学东方学院',
              "<br>"+'山东农业大学',
              "<br>"+'泰山医学院',
              "<br>"+'泰山学院',
              "<br>"+'山东服装职业学院',
              "<br>"+'山东力明科技职业学院',
              "<br>"+'泰山职业技术学院',
              "<br>"+'泰山护理职业学院'
            ]
            var  laiwu= [
              "<strong>"+"<br>"+'莱芜职业技术学院'
            ]
            var zhangjiakou = [
              "<strong>"+"<br>"+'北建筑工程学院',
              "<br>"+'河北北方学院',
              "<br>"+'张家口学院',
              "<br>"+'张家口职业技术学院',
              "<br>"+'宣化科技职业学院'
            ]
            var chengde = [
              "<strong>"+"<br>"+'承德医学院',
              "<br>"+'河北民族师范学院',
              "<br>"+'承德石油高等专科学校',
              "<br>"+'河北旅游职业学院',
              "<br>"+'承德护理职业学院'
            ]
            var qinghuangdao = [
              "<strong>"+"<br>"+'燕山大学',
              "<br>"+'河北科技师范学院',
              "<br>"+'燕山大学里仁学院',
              "<br>"+'河北建材职业技术学院'
            ]
            var tangshan = [
              "<strong>"+"<br>"+'华北理工大学',
              "<br>"+'唐山师范学院',
              "<br>"+'唐山学院',
              "<br>"+'华北理工大学轻工学院',
              "<br>"+'华北理工大学冀唐学院',
              "<br>"+'河北能源职业技术学院',
              "<br>"+'唐山职业技术学院',
              "<br>"+'唐山科技职业技术学院',
              "<br>"+'曹妃甸职业技术学院'
            ]
            var langfang = [
              "<strong>"+"<br>"+'廊坊师范学院',
              "<br>"+'华北科技学院',
              "<br>"+'中国人民武装警察部队学院',
              "<br>"+'北华航天工业学院',
              "<br>"+'防灾科技学院',
              "<br>"+'河北工业大学城市学院',
              "<br>"+'燕京理工学院',
              "<br>"+'北京中医药大学东方学院',
              "<br>"+'河北石油职业技术学院',
              "<br>"+'廊坊职业技术学院',
              "<br>"+'河北东方学院',
              "<br>"+'廊坊燕京职业技术学院'
            ]
            var baoding = [
              "<strong>"+"<br>"+'河北大学',
              "<br>"+'河北农业大学',
              "<br>"+'保定学院',
              "<br>"+'河北金融学院',
              "<br>"+'中央司法警官学院',
              "<br>"+'河北科技学院',
              "<br>"+'河北大学工商学院',
              "<br>"+'华北电力大学科技学院',
              "<br>"+'河北农业大学现代科技学院',
              "<br>"+'中国地质大学长城学院',
              "<br>"+'河北软件职业技术学院',
              "<br>"+'保定职业技术学院'
            ]
            var shijiazhuang = [
              "<strong>"+"<br>"+'河北地质大学',
              "<br>"+'河北科技大学',
              "<br>"+'河北医科大学',
              "<br>"+'河北师范大学',
              "<br>"+'石家庄学院',
              "<br>"+'石家庄铁道大学',
              "<br>"+'河北体育学院',
              "<br>"+'河北经贸大学',
              "<br>"+'河北传媒学院',
              "<br>"+'河北美术学院',
              "<br>"+'河北外国语学院',
              "<br>"+'河北科技大学理工学院',
              "<br>"+'河北师范大学汇华学院',
              "<br>"+'河北师范大学汇华学院',
              "<br>"+'石家庄铁道大学四方学院',
              "<br>"+'河北地质大学华信学院',
              "<br>"+'河北中医学院',
              "<br>"+'河北工业职业技术学院',
              "<br>"+'石家庄职业技术学院',
              "<br>"+'河北政法职业学院',
              "<br>"+'石家庄铁路职业技术学院',
              "<br>"+'石家庄工程职业学院'
            ]
            var xingtai = [
              "<strong>"+"<br>"+'邢台学院',
              "<br>"+'邢台职业技术学院',
              "<br>"+'"邢台医学高等专科学校',
              "<br>"+'河北机电职业技术学院'
            ]
            var handan = [
              "<strong>"+"<br>"+'河北工程大学',
              "<br>"+'邯郸学院',
              "<br>"+'河北工程大学科信学院',
              "<br>"+'邯郸职业技术学院'
            ]
            var hengshui = [
              "<strong>"+"<br>"+'衡水学院',
              "<br>"+'衡水职业技术学院'
            ]
            var cangzhou = [
              "<strong>"+"<br>"+'沧州师范学院',
              "<br>"+'北京交通大学海滨学院"',
              "<br>"+'河北水利电力学院',
              "<br>"+'沧州职业技术学院',
              "<br>"+'渤海石油职业学院',
              "<br>"+'渤海石油职业学院',
              "<br>"+'沧州医学高等专科学校',
              "<br>"+'泊头职业学院'
            ]
            var tieling = [
              "<strong>"+"<br>"+'铁岭师范高等专科学校',
              "<br>"+'辽宁职业学院',
              "<br>"+'辽宁工程职业学院',
              "<br>"+'辽宁工程职业学院'
            ]
            var fushun = [
              "<strong>"+"<br>"+'辽宁石油化工大学',
              "<br>"+'辽宁石油化工大学顺华能源学院',
              "<br>"+'抚顺师范高等专科学校',
              "<br>"+'抚顺职业技术学院'
            ]
            var shenyang = [
              "<strong>"+"<br>"+'辽宁大学',
              "<br>"+'沈阳工业大学',
              "<br>"+'沈阳航空航天大学',
              "<br>"+'沈阳理工大学',
              "<br>"+'东北大学',
              "<br>"+'沈阳化工大学',
              "<br>"+'沈阳建筑大学',
              "<br>"+'沈阳农业大学',
              "<br>"+'辽宁中医药大学',
              "<br>"+'沈阳药科大学',
              "<br>"+'沈阳医学院',
              "<br>"+'沈阳师范大学',
              "<br>"+'中国刑事警察学院',
              "<br>"+'沈阳体育学院',
              "<br>"+'沈阳音乐学院',
              "<br>"+'鲁迅美术学院',
              "<br>"+'沈阳大学',
              "<br>"+'沈阳工程学院',
              "<br>"+'沈阳工学院',
              "<br>"+'沈阳航空航天大学北方科技学院',
              "<br>"+'沈阳城市建设学院',
              "<br>"+'中国医科大学临床医药学院'
            ]
            var fuxing = [
              "<strong>"+"<br>"+'辽宁工程技术大学',
              "<br>"+'阜新高等专科学校'
            ]
            var chaoyang = [
              "<strong>"+"<br>"+'朝阳师范高等专科学校'
            ]
            var jingzhou = [
              "<strong>"+"<br>"+'辽宁工业大学',
              "<br>"+'锦州医科大学',
              "<br>"+'渤海大学',
              "<br>"+'锦州医科大学医疗学院',
              "<br>"+'辽宁理工学院',
              "<br>"+'锦州师范高等专科学校',
              "<br>"+'辽宁理工职业学院',
              "<br>"+'辽宁石化职业技术学院',
              "<br>"+'辽宁铁道职业技术学院',
              "<br>"+'辽宁工业大学',
              "<br>"+'锦州医科大学'
            ]
            var huludao = [
              "<strong>"+"<br>"+'辽宁财贸学院',
              "<br>"+'渤海船舶职业学院'
            ]
            var panjing = [
              "<strong>"+"<br>"+'辽河石油职业技术学院',
              "<br>"+'盘锦职业技术学院'
            ]
            var anshan = [
              "<strong>"+"<br>"+'辽宁科技大学',
              "<br>"+'鞍山师范学院'
            ]
            var liaoyang = [
              "<strong>"+"<br>"+'沈阳工业大学工程学院',
              "<br>"+'辽阳职业技术学院',
              "<br>"+'辽宁建筑职业学院'
              
            ]
            var benxi = [
              "<strong>"+"<br>"+'辽宁科技学院',
              "<br>"+'辽宁冶金职业技术学院'
            ]
            var dandong = [
              "<strong>"+"<br>"+'辽东学院',
              "<br>"+'辽宁机电职业技术学院'
            ]
            var dalian = [
              "<strong>"+"<br>"+'大连理工大学',
              "<br>"+'大连交通大学',
              "<br>"+'大连海事大学',
              "<br>"+'大连工业大学',
              "<br>"+'大连海洋大学',
              "<br>"+'大连医科大学',
              "<br>"+'辽宁师范大学',
              "<br>"+'大连外国语大学',
              "<br>"+'东北财经大学',
              "<br>"+'辽宁对外经贸学院',
              "<br>"+'大连大学',
              "<br>"+'辽宁警察学院',
              "<br>"+'大连民族大学',
              "<br>"+'大连理工大学城市学院',
              "<br>"+'大连工业大学艺术与信息工程学院',
              "<br>"+'大连科技学院',
              "<br>"+'大连医科大学中山学院',
              "<br>"+'大连财经学院',
              "<br>"+'大连艺术学院',
              "<br>"+'大连东软信息学院',
              "<br>"+'大连职业技术学院',
              "<br>"+'辽宁税务高等专科学校'
            ]
            var yingkou = [
              "<strong>"+"<br>"+'营口理工学院',
              "<br>"+'营口职业技术学院',
              "<br>"+'辽宁农业职业技术学院'
            ]
            var baicheng = [
              "<strong>"+"<br>"+'白城师范学院',
              "<br>"+'白城医学高等专科学校',
              "<br>"+'白城职业技术学院'
            ]
            var songyuan = [
              "<strong>"+"<br>"+'松原职业技术学院'
            ]
            var changchun = [
              "<strong>"+"<br>"+'吉林大学',
              "<br>"+'长春理工大学',
              "<br>"+'长春工业大学',
              "<br>"+'吉林建筑大学',
              "<br>"+'吉林农业大学',
              "<br>"+'长春中医药大学',
              "<br>"+'东北师范大学',
              "<br>"+'吉林工程技术师范学院',
              "<br>"+'长春师范大学',
              "<br>"+'吉林财经大学',
              "<br>"+'吉林体育学院',
              "<br>"+'吉林艺术学院',
              "<br>"+'吉林华桥外国语学院',
              "<br>"+'吉林工商学院',
              "<br>"+'长春工程学院',
              "<br>"+'吉林警察学院',
              "<br>"+'长春大学',
              "<br>"+'长春工业大学人文信息学院',
              "<br>"+'吉林建筑大学城建学院',
              "<br>"+'长春建筑学院',
              "<br>"+'长春科技学院',
              "<br>"+'吉林动画学院'
            ]
            var jilin = [
              "<strong>"+"<br>"+'东北电力大学',
              "<br>"+'吉林化工学院',
              "<br>"+'北华大学',
              "<br>"+'吉林农业科技学院',
              "<br>"+'吉林医药学院',
              "<br>"+'吉林电子信息职业技术学院',
              "<br>"+'吉林工业职业技术学院'
              ]
            var  siping= [
              "<strong>"+"<br>"+'吉林师范大学',
              "<br>"+'吉林师范大学博达学院',
              "<br>"+'四平职业大学',
              "<br>"+'吉林工程职业学院'
            ]
            var liaoyuan = [
              "<strong>"+"<br>"+'辽源职业技术学院'
            ]
            var baihsan = [
              "<strong>"+"<br>"+'白城职业技术学院',
              "<br>"+'白城医学高等专科学校',
              "<br>"+'长白山职业技术学院'
            ]
            var tonghua = [
              "<strong>"+"<br>"+'通化师范学院'
            ]
            var yanbian = [
              "<strong>"+"<br>"+'延边大学',
              "<br>"+'延边职业技术学院',
              "<br>"+'吉林职业技术学院'
            ]
            var daxinganlin = [
              "<strong>"+"<br>"+'大兴安岭职业学院'
            ]
            var heihe = [
              "<strong>"+"<br>"+'黑河学院'
              ]
            var yichun = [
              "<strong>"+"<br>"+'伊春职业学院'
            ]
            var qiqihaer = [
              "<strong>"+"<br>"+'齐齐哈尔大学',
              "<br>"+'齐齐哈尔医学院',
              "<br>"+'齐齐哈尔工程学院',
              "<br>"+'齐齐哈尔高等师范专科学校',
              "<br>"+'黑龙江交通职业技术学院',
              "<br>"+'齐齐哈尔理工职业学院'
            ]
            var daqing = [
              "<strong>"+"<br>"+'东北石油大学',
              "<br>"+'黑龙江八一农垦大学',
              "<br>"+'大庆师范学院',
              "<br>"+'大庆职业学院'
            ]
            var suihua = [
              "<strong>"+"<br>"+'绥化学院'
            ]
            var haerbing = [
              "<strong>"+"<br>"+'黑龙江大学',
              "<br>"+'哈尔滨工业大学',
              "<br>"+'哈尔滨理工大学',
              "<br>"+'哈尔滨工程大学',
              "<br>"+'黑龙江科技大学',
              "<br>"+'东北农业大学',
              "<br>"+'东北林业大学',
              "<br>"+'哈尔滨医科大学',
              "<br>"+'黑龙江中医药大学',
              "<br>"+'哈尔滨师范大学',
              "<br>"+'齐齐哈尔大学',
              "<br>"+'哈尔滨学院',
              "<br>"+'哈尔滨商业大学',
              "<br>"+'哈尔滨体育学院',
              "<br>"+'哈尔滨金融学院',
              "<br>"+'黑龙江工程学院',
              "<br>"+'黑龙江外国语学院',
              "<br>"+'黑龙江财经学院',
              "<br>"+'黑龙江工商学院',
              "<br>"+'哈尔滨石油学院',
              "<br>"+'哈尔滨广厦学院',
              "<br>"+'哈尔滨华德学院'
            ]
            var mudanjiang  = [
              "<strong>"+"<br>"+'牡丹江医学院',
              "<br>"+'牡丹江师范学院',
              "<br>"+'牡丹江大学',
              "<br>"+'黑龙江林业职业技术学院',
              "<br>"+'黑龙江农业经济职业学院',
              "<br>"+'黑龙江商业职业学院'
            ]
            var jixi = [
              "<strong>"+"<br>"+'黑龙江工业学院'
            ]
            var qitaihe = [
              "<strong>"+"<br>"+'七台河职业学院'
            ]
            var shuangyashan = [
              "<strong>"+"<br>"+'黑龙江能源职业学院'
            ]
            var jiamusi = [
              "<strong>"+"<br>"+'佳木斯大学',
              "<br>"+'黑龙江农业职业技术学院',
              "<br>"+'黑龙江三江美术职业学院',
              "<br>"+'佳木斯职业学院'
            ]
            var hegang = [
              "<strong>"+"<br>"+'鹤岗师范高等专科学校'
            ]
            var  hulunbeier = [
              "<strong>"+"<br>"+'呼伦贝尔学院',
              "<br>"+'呼伦贝尔职业技术学院',
              "<br>"+'满洲里俄语职业学院'
            ]
            var  anxingmeng = [
              "<strong>"+"<br>"+'兴安职业技术学院'
            ]
            var  tongliao = [
              "<strong>"+"<br>"+'内蒙古民族大学',
              "<br>"+'通辽职业学院',
              "<br>"+'科尔沁艺术职业学院'
            ]
            var chifeng  = [
              "<strong>"+"<br>"+'赤峰学院',
              "<br>"+'内蒙古交通职业技术学院',
              "<br>"+'赤峰职业技术学院',
              "<br>"+'赤峰工业职业技术学院'
            ]
            var  xilin = [
              "<strong>"+"<br>"+'锡林郭勒职业学院'
            ]
            var  wulanchabubu = [
              "<strong>"+"<br>"+'集宁师范学院',
              "<br>"+'乌兰察布职业学院',
              "<br>"+'乌兰察布医学高等专科学院'
            ]
            var  huhehaote = [
              "<strong>"+"<br>"+'内蒙古大学',
              "<br>"+'内蒙古工业大学',
              "<br>"+'内蒙古农业大学',
              "<br>"+'内蒙古医科大学',
              "<br>"+'内蒙古师范大学',
              "<br>"+'内蒙古财经大学',
              "<br>"+'呼和浩特民族学院',
              "<br>"+'内蒙古大学创业学院',
              "<br>"+'内蒙古艺术学院',
              "<br>"+'内蒙古师范大学鸿德学院',
              "<br>"+'内蒙古建筑职业技术学院',
              "<br>"+'内蒙古丰州职业学院"'
            ]
            var  baotou = [
              "<strong>"+"<br>"+'内蒙古科技大学',
              "<br>"+'包头职业技术学院',
              "<br>"+'包头轻工职业技术学院'
            ]
            var  eerduosi = [
              "<strong>"+"<br>"+'鄂尔多斯应用技术学院',
              "<br>"+'鄂尔多斯职业学院',
              "<br>"+'内蒙古民族幼儿师范高等专科学校',
              "<br>"+'鄂尔多斯生态环境职业学院'
            ]
            var wuhai  = [
              "<strong>"+"<br>"+'乌海职业技术学院'
            ]
            var alashanmeng  = [
              "<strong>"+"<br>"+'阿拉善职业技术学院'
            ]
            var bayan  = [
              "<strong>"+"<br>"+'河套学院',
              "<br>"+'内蒙古美术职业学院'
            ]
          
            var  datong = [
              "<strong>"+"<br>"+'山西大同大学',
              "<br>"+'大同煤炭职业技术学院'
            ]
            var  jincheng = [
              "<strong>"+"<br>"+'晋城职业技术学院'
            ]
            var  yangquan = [
              "<strong>"+"<br>"+'山西工程技术学院',
              "<br>"+'阳泉职业技术学院',
              "<br>"+'阳泉师范高等专科学校'
            ]
            var  xinzhou = [
              "<strong>"+"<br>"+'山西大学',
              "<br>"+'太原科技大学',
              "<br>"+'中北大学',
              "<br>"+'太原理工大学',
              "<br>"+'山西医科大学"',
              "<br>"+'太原师范学院',
              "<br>"+'山西财经大学',
              "<br>"+'山西中医药大学',
              "<br>"+'太原学院',
              "<br>"+'山西应用科技学院',
              "<br>"+'山西大学商务学院',
              "<br>"+'太原理工大学现代科技学院',
              "<br>"+'中北大学信息商务学院',
              "<br>"+'山西艺术职业学院',
              "<br>"+'山西建筑职业技术学院',
              "<br>"+'山西药科职业学院',
              "<br>"+'山西工程职业技术学院',
              "<br>"+'山西戏剧职业学院',
              "<br>"+'山西财贸职业技术学院',
              "<br>"+'山西林业职业技术学院',
              "<br>"+'山西职业技术学院',
              "<br>"+'山西金融职业学院'
            ]
            var  taiyuan = [
              "<strong>"+"<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+'',
              "<br>"+''
            ]
            var jinzhou  = [
              "<strong>"+"<br>"+'忻州职业技术学院',
              "<br>"+'忻州师范学院'
            ]
            var  linyi = [
              "<strong>"+"<br>"+'山西师范大学',
              "<br>"+'山西师范大学现代文理学院',
              "<br>"+'临汾职业技术学院',
              "<br>"+'山西信息职业技术学院',
              "<br>"+'山西管理职业学院'
            ]
            var changzhi  = [
              "<strong>"+"<br>"+'长治医学院',
              "<br>"+'长治学院',
              "<br>"+'长治职业技术学院',
              "<br>"+'山西机电职业技术学院',
              "<br>"+'潞安职业技术学院'
            ]
            var  yuncheng = [
              "<strong>"+"<br>"+'运城学院',
              "<br>"+'山西水利职业技术学院',
              "<br>"+'山西运城农业职业技术学院',
              "<br>"+'运城幼儿师范高等专科学校',
              "<br>"+'运城职业技术学院',
              "<br>"+'运城护理职业学院',
              "<br>"+'运城师范高等专科学校'
            ]
            var  lvliang = [
              "<strong>"+"<br>"+'吕梁学院',
              "<br>"+'吕梁职业技术学院'
            ]
            var  suzhou = [
              "<strong>"+"<br>"+'朔州职业技术学院',
              "<br>"+'朔州师范高等专科学校'
            ]
            var  yulin = [
              "<strong>"+"<br>"+'榆林学院',
              "<br>"+'榆林职业技术学院'
            ]
            var yanan  = [
              "<strong>"+"<br>"+'延安大学',
              "<br>"+'延安大学西安创新学院',
              "<br>"+'延安职业技术学院'
            ]
            var tongchuan  = [
              "<strong>"+"<br>"+'铜川职业技术学院'
            ]
            var  weinan = [
              "<strong>"+"<br>"+'渭南师范学院',
              "<br>"+'陕西铁路工程职业技术学院',
              "<br>"+'渭南职业技术学院'
            ]
            var shangluo  = [
              "<strong>"+"<br>"+'商洛学院',
              "<br>"+'商洛职业技术学院'
            ]
            var  ankang = [
              "<strong>"+"<br>"+'安康学院',
              "<br>"+'安康职业技术学院'
            ]
            var  hanzhong = [
              "<strong>"+"<br>"+'陕西理工大学',
              "<br>"+'陕西航空职业技术学院',
              "<br>"+'汉中职业技术学院'
            ]
            var baoji  = [
              "<strong>"+"<br>"+'宝鸡文理学院',
              "<br>"+'宝鸡职业技术学院',
              "<br>"+'陕西机电职业技术学院'
            ]
            var xianyang  = [
              "<strong>"+"<br>"+'西北农林科技大学',
              "<br>"+'陕西中医药大学',
              "<br>"+'咸阳师范学院',
              "<br>"+'陕西国际商贸学院',
              "<br>"+'陕西服装工程学院',
              "<br>"+'陕西科技大学镐京学院',
              "<br>"+'陕西工业职业技术学院',
              "<br>"+'杨凌职业技术学院',
              "<br>"+'陕西能源职业技术学院',
              "<br>"+'陕西财经职业技术学院',
              "<br>"+'陕西邮电职业技术学院',
              "<br>"+'咸阳职业技术学院'
            ]
            var xian  = [
              "<strong>"+"<br>"+'西北大学',
              "<br>"+'西安交通大学',
              "<br>"+'西西安理工大学',
              "<br>"+'西安交通大学',
              "<br>"+'西北工业大学',
              "<br>"+'西安电子科技大学',
              "<br>"+'西安建筑科技大学',
              "<br>"+'西安科技大学',
              "<br>"+'西安石油大学',
              "<br>"+'陕西科技大学',
              "<br>"+'长安大学',
              "<br>"+'陕西师范大学',
              "<br>"+'西安外国语大学',
              "<br>"+'西北政法大学',
              "<br>"+'西安体育学院',
              "<br>"+'西安音乐学院',
              "<br>"+'西安美术学院',
              "<br>"+'西安财经学院',
              "<br>"+'西安培华学院',
              "<br>"+'西安航空学院',
              "<br>"+'西安航空学院',
              "<br>"+'西安外事学院',
              "<br>"+'西安翻译学院',
              "<br>"+'西安思源学院',
              "<br>"+'西京学院',
              "<br>"+'西安交通工程学院',
              "<br>"+'西北大学现代学院',
              "<br>"+'西安建筑科技大学华清学院',
              "<br>"+'西安财经学院行知学院',
              "<br>"+'西安电子科技大学长安学院',
              "<br>"+'西安工业大学北方信息工程学院',
              "<br>"+'长安大学兴华学院'
            ]
            var yingchuan  = [
              "<strong>"+"<br>"+'宁夏大学',
              "<br>"+'宁夏医科大学',
              "<br>"+'北方民族大学',
              "<br>"+'宁夏大学新华学院',
              "<br>"+'银川能源学院',
              "<br>"+'银川能源学院',
              "<br>"+'宁夏工业职业学院',
              "<br>"+'宁夏职业技术学院',
              "<br>"+'宁夏财经职业技术学院',
              "<br>"+'宁夏职业技术学院',
              "<br>"+'宁夏警官职业学院',
              "<br>"+'宁夏建设职业技术学院'
            ]
            var  shizuishan = [
              "<strong>"+"<br>"+'宁夏理工学院'
            ]
            var wuzhong  = [
              "<strong>"+"<br>"+'宁夏民族职业技术学院'
            ]
            var guyuan  = [
              "<strong>"+"<br>"+'宁夏师范学院'
            ]
            var  jiagugaun = [
              "<strong>"+"<br>"+'甘肃钢铁职业技术学院'
            ]
            var jiuquan  = [
              "<strong>"+"<br>"+'酒泉职业技术学院'
            ]
            var zhangye  = [
              "<strong>"+"<br>"+'河西学院'
            ]
            var jinchang  = [
              "<strong>"+"<br>"+'甘肃有色冶金职业技术学院'
            ]
            var wuwei  = [
              "<strong>"+"<br>"+'武威职业学院',
              "<br>"+'甘肃畜牧工程职业技术学院'
            ]
            var baiyin  = [
              "<strong>"+"<br>"+'白银矿冶职业技术学院'
            ]
            var lanzhou  = [
              "<strong>"+"<br>"+'兰州大学',
              "<br>"+'兰州理工大学',
              "<br>"+'兰州交通大学',
              "<br>"+'兰州交通大学',
              "<br>"+'甘肃农业大学',
              "<br>"+'甘肃中医药大学',
              "<br>"+'西北师范大学',
              "<br>"+'兰州城市学院',
              "<br>"+'兰州财经大学',
              "<br>"+'西北民族大学',
              "<br>"+'甘肃政法学院',
              "<br>"+'兰州工业学院',
              "<br>"+'兰州文理学院',
              "<br>"+'兰州财经大学陇桥学院',
              "<br>"+'西北师范大学知行学院',
              "<br>"+'兰州交通大学博文学院',
              "<br>"+'兰州石化职业技术学院',
              "<br>"+'甘肃警察职业学院',
              "<br>"+'兰州职业技术学院',
              "<br>"+'兰州外语职业学院',
              "<br>"+'兰州资源环境职业技术学院',
              "<br>"+'甘肃交通职业技术学院',
              "<br>"+'甘肃卫生职业学院',
              "<br>"+'甘肃能源化工职业学院',
              "<br>"+'兰州现代职业学院',
              "<br>"+'甘肃财贸职业学院'
            ]
            var dingxi  = [
              "<strong>"+"<br>"+'定西师范高等专科学校'
            ]
            var longnan  = [
              "<strong>"+"<br>"+'陇南师范高等专科学校'
            ]
           
            var  pingliang = [
              "<strong>"+"<br>"+'甘肃医学院',
              "<br>"+'平凉职业技术学院'
            ]
            var tianshui  = [
              "<strong>"+"<br>"+'天水师范学院',
              "<br>"+'甘肃林业职业技术学院',
              "<br>"+'甘肃工业职业技术学院',
              "<br>"+'甘肃机电职业技术学院'
            ]
            var xining  = [
              "<strong>"+"<br>"+'青海大学',
              "<br>"+'青海师范大学',
              "<br>"+'青海民族大学',
              "<br>"+'青海大学昆仑学院',
              "<br>"+'青海卫生职业技术学院',
              "<br>"+'青海警官职业学院',
              "<br>"+'青海畜牧兽医职业技术学院',
              "<br>"+'青海交通职业技术学院',
              "<br>"+'青海建筑职业技术学院',
              "<br>"+'西宁城市职业技术学院'
            ]
            var  haidong = [
              "<strong>"+"<br>"+'青海高等职业技术学院'
            ]
            var  haiximenggu = [
              "<strong>"+"<br>"+'青海柴达木职业技术学院'
            ]
            var  wulumuqi = [
              "<strong>"+"<br>"+'新疆大学',
              "<br>"+'新疆农业大学',
              "<br>"+'新疆医科大学',
              "<br>"+'新疆师范大学',
              "<br>"+'新疆财经大学',
              "<br>"+'新疆工程学院',
              "<br>"+'新疆警察学院',
              "<br>"+'新疆大学科学技术学院',
              "<br>"+'新疆大学科学技术学院',
              "<br>"+'新疆医科大学厚博学院',
              "<br>"+'新疆财经大学商务学院',
              "<br>"+'乌鲁木齐职业大学',
              "<br>"+'新疆机电职业技术学院',
              "<br>"+'新疆能源职业技术学院',
              "<br>"+'新疆轻工职业技术学院',
              "<br>"+'新疆现代职业技术学院',
              "<br>"+'新疆天山职业技术学院',
              "<br>"+'新疆师范高等专科学校',
              "<br>"+'新疆体育职业技术学院',
              "<br>"+'新疆铁道职业技术学院',
              "<br>"+'新疆生产建设兵团兴新职业技术学院',
              "<br>"+'新疆科技职业技术学院'
            ]
            var alaer  = [
              "<strong>"+"<br>"+'塔里木大学'
            ]
            var shihezi  = [
              "<strong>"+"<br>"+'石河子大学',
              "<br>"+'石河子大学科技学院',
              "<br>"+'新疆石河子职业技术学院'
            ]
            var kashen  = [
              "<strong>"+"<br>"+'喀什大学'
            ]
            var yili  = [
              "<strong>"+"<br>"+'伊犁师范学院',
              "<br>"+'伊犁职业技术学院',
              "<br>"+'新疆应用职业技术学院'
            ]
            var  changji = [
              "<strong>"+"<br>"+'昌吉学院',
              "<br>"+'新疆农业职业技术学院',
              "<br>"+'昌吉职业技术学院'
            ]
            var hetiandiq  = [
              "<strong>"+"<br>"+'和田师范专科学校',
              "<br>"+'新疆维吾尔医学专科学校'
            ]
            var kelamayi  = [
              "<strong>"+"<br>"+'克拉玛依职业技术学院'
            ]
           
            var wujiaqu  = [
              "<strong>"+"<br>"+'新疆兵团警官高等专科学校'
            ]
            var  hami = [
              "<strong>"+"<br>"+'哈密职业技术学院'
            ]
            var  tulufan = [
              "<strong>"+"<br>"+'吐鲁番职业技术学院'
             
            ]
           
            var lasa  = [
              "<strong>"+"<br>"+'西藏大学',
              "<br>"+'西藏藏医学院',
              "<br>"+'西藏警官高等专科学校',
              "<br>"+'拉萨师范高等专科学校',
              "<br>"+'西藏职业技术学院'
            ]
            var  xianyang2 = [
              "<strong>"+"<br>"+'西藏民族大学'
            ]
            var linzhi  = [
              "<strong>"+"<br>"+'西藏农牧学院'
              ]
            var  kunming = [
              "<strong>"+"<br>"+'云南大学',
              "<br>"+'云南大学',
              "<br>"+'云南农业大学',
              "<br>"+'西南林业大学',
              "<br>"+'昆明医科大学',
              "<br>"+'云南财经大学',
              "<br>"+'云南艺术学院',
              "<br>"+'云南民族大学',
              "<br>"+'昆明理工大学津桥学院',
              "<br>"+'云南师范大学商学院',
              "<br>"+'云南师范大学商学院',
              "<br>"+'昆明医科大学海源学院',
              "<br>"+'云南艺术学院文华学院',
              "<br>"+'云南工商学院',
              "<br>"+'昆明冶金高等专科学校',
              "<br>"+'云南工商学院',
              "<br>"+'昆明工业职业技术学院',
              "<br>"+'云南农业职业技术学院',
              "<br>"+'云南司法警官职业学院',
              "<br>"+'云南文化艺术职业学院',
              "<br>"+'昆明艺术职业学院',
              "<br>"+'云南国防工业职业技术学院',
              "<br>"+'云南林业职业技术学院',
              "<br>"+'云南工程职业学院',
              "<br>"+'云南商务职业学院',
              "<br>"+'云南新兴职业学院',
              "<br>"+'云南特殊教育职业学院'
            ]
            var  dalibaizu = [
              "<strong>"+"<br>"+'大理大学',
              "<br>"+'大理农林职业技术学院',
              "<br>"+'大理护理职业学院',
              "<br>"+'滇西应用技术大学'
            ]
            var  shaotong = [
              "<strong>"+"<br>"+'昭通学院',
              "<br>"+'昭通卫生职业学院'
            ]
            var  qujing = [
              "<strong>"+"<br>"+'曲靖师范学院',
              "<br>"+'曲靖师范学院',
              "<br>"+'曲靖师范学院'
            ]
            var  puer = [
              "<strong>"+"<br>"+'普洱学院'
            ]
            var  baoshan1 = [
              "<strong>"+"<br>"+'保山学院',
              "<br>"+'保山中医药高等专科学校'
            ]
            var  honghe = [
              "<strong>"+"<br>"+'红河学院',
              "<br>"+'红河学院',
              "<br>"+'红河卫生职业学院'
            ]
            var  yuxi = [
              "<strong>"+"<br>"+'玉溪师范学院',
              "<br>"+'玉溪农业职业技术学院'
            ]
            var  chuxiong = [
              "<strong>"+"<br>"+'楚雄师范学院',
              "<br>"+'楚雄医药高等专科学校',
              "<br>"+'云南现代职业技术学院'
            ]
            var  wenshan = [
              "<strong>"+"<br>"+'文山学院',
              "<br>"+'云南三鑫职业技术学院'
            ]
            var  lijiang = [
              "<strong>"+"<br>"+'云南大学旅游文化学院',
              "<br>"+'丽江师范高等专科学校'
            ]
            var  lincang = [
              "<strong>"+"<br>"+'滇西科技师范学院'
            ]
            var  xishuangbanna = [
              "<strong>"+"<br>"+'西双版纳职业技术学院'
            ]
            var dehong  = [
              "<strong>"+"<br>"+'德宏师范高等专科学校',
              "<br>"+'德宏职业学院'
            ]
            var  nanning = [
              "<strong>"+"<br>"+'广西大学',
              "<br>"+'广西医科大学',
              "<br>"+'广西中医药大学',
              "<br>"+'广西师范学院',
              "<br>"+'广西艺术学院',
              "<br>"+'广西民族大学',
              "<br>"+'广西财经学院',
              "<br>"+'南宁学院',
              "<br>"+'广西警察学院',
              "<br>"+'广西大学行健文理学院',
              "<br>"+'广西民族大学相思湖学院',
              "<br>"+'广西外国语学院',
              "<br>"+'广西机电职业技术学院',
              "<br>"+'广西体育高等专科学校',
              "<br>"+'南宁职业技术学院',
              "<br>"+'广西水利电力职业技术学院',
              "<br>"+'广西职业技术学院',
              "<br>"+'广西交通职业技术学院',
              "<br>"+'广西国际商务职业技术学院'
            ]
            var  liuzhou = [
              "<strong>"+"<br>"+'广西科技大学',
              "<br>"+'广西科技大学鹿山学院',
              "<br>"+'柳州职业技术学院',
              "<br>"+'柳州职业技术学院',
              "<br>"+'柳州铁道职业技术学院',
              "<br>"+'柳州城市职业学院'
            ]
            var  guiling = [
              "<strong>"+"<br>"+'桂林电子科技大学',
              "<br>"+'桂林理工大学',
              "<br>"+'桂林医学院',
              "<br>"+'广西师范大学',
              "<br>"+'桂林航天工业学院',
              "<br>"+'桂林旅游学院',
              "<br>"+'广西师范大学漓江学院',
              "<br>"+'桂林电子科技大学信息科技学院',
              "<br>"+'桂林理工大学博文管理学院',
              "<br>"+'桂林师范高等专科学校'
            ]
            var  baise = [
              "<strong>"+"<br>"+'右江民族医学院',
              "<br>"+'右江民族医学院',
              "<br>"+'百色职业学院',
              "<br>"+'广西工程职业学院',
              "<br>"+'广西培贤国际职业学院'
            ]
            var  chongzuo = [
              "<strong>"+"<br>"+'广西民族师范学院',
              "<br>"+'广西城市职业学院',
              "<br>"+'广西理工职业技术学院',
              "<br>"+'广西科技职业学',
              "<br>"+'广西中远职业学院'
            ]
            var  hechi = [
              "<strong>"+"<br>"+'河池学院',
              "<br>"+'广西现代职业技术学院'
            ]
            var  yulin = [
              "<strong>"+"<br>"+'玉林师范学院',
              "<br>"+'玉柴职业技术学院'
            ]
            var  wuzhou = [
              "<strong>"+"<br>"+'梧州学院',
              "<br>"+'梧州职业学院'
            ]
            var  laibing = [
              "<strong>"+"<br>"+'广西科技师范学院',
              "<br>"+'广西蓝天航空职业学院'
            ]
            var  qingzhou = [
              "<strong>"+"<br>"+'钦州学院',
              "<br>"+'广西英华国际职业学院'
            ]
            var  hezhou = [
              "<strong>"+"<br>"+'贺州学院'
            ]
            var  beihai = [
              "<strong>"+"<br>"+'北海艺术设计学院',
              "<br>"+'北京航空航天大学北海学院',
              "<br>"+'北海职业学院'
            ]
            var  chengdu = [
              "<strong>"+"<br>"+'四川大学',
              "<br>"+'西南交通大学',
              "<br>"+'电子科技大学',
              "<br>"+'西南石油大学',
              "<br>"+'成都理工大学',
              "<br>"+'成都信息工程大学',
              "<br>"+'西华大学',
              "<br>"+'成都中医药大学',
              "<br>"+'四川师范大学',
              "<br>"+'西南财经大学',
              "<br>"+'成都体育学院',
              "<br>"+'四川音乐学院',
              "<br>"+'西南民族大学',
              "<br>"+'成都学院',
              "<br>"+'成都工业学院',
              "<br>"+'四川旅游学院',
              "<br>"+'成都东软学院',
              "<br>"+'电子科技大学成都学院',
              "<br>"+'四川传媒学院',
              "<br>"+'成都信息工程大学银杏酒店管理学院',
              "<br>"+'成都文理学院',
              "<br>"+'四川工商学院',
              "<br>"+'四川外国语大学成都学院',
              "<br>"+'成都医学院',
              "<br>"+'四川大学锦城学院',
              "<br>"+'成都师范学院',
              "<br>"+'四川电影电视学院',
              "<br>"+'成都纺织高等专科学校',
              "<br>"+'民办四川天一学院',
              "<br>"+'成都航空职业技术学院',
              "<br>"+'四川电力职业技术学院',
              "<br>"+'成都职业技术学院',
              "<br>"+'四川水利职业技术学院',
              "<br>"+'四川航天职业技术学院',
              "<br>"+'四川邮电职业技术学院',
              "<br>"+'四川交通职业技术学院',
              "<br>"+'四川工商职业技术学院',
              "<br>"+'四川国际标榜职学院',
              "<br>"+'成都农业科技职业学院',
              "<br>"+'成都农业科技职业学院',
              "<br>"+'四川文化传媒职业学院',
              "<br>"+'四川艺术职业学院'
            ]
            var  mianyang = [
              "<strong>"+"<br>"+'西南科技大学',
              "<br>"+'绵阳师范学院',
              "<br>"+'西南财经大学天府学院',
              "<br>"+'四川文化艺术学院',
              "<br>"+'西南科技大学城市学院',
              "<br>"+'绵阳职业技术学院',
              "<br>"+'四川中医药高等专科学校',
              "<br>"+'"四川幼儿师范高等专科学校',
              "<br>"+'四川汽车职业技术学院',
              "<br>"+'四川电子机械职业技术学院',
              "<br>"+'',
              "<br>"+''
            ]
            var  zigong = [
              "<strong>"+"<br>"+'四川理工学院',
              "<br>"+'四川卫生康复职业学院'
            ]
            var  deyang = [
              "<strong>"+"<br>"+'中国民用航空飞行学院',
              "<br>"+'中国民用航空飞行学院',
              "<br>"+'四川工程职业技术学院',
              "<br>"+'四川建筑职业技术学院',
              "<br>"+'四川司法警官职业学院',
              "<br>"+'四川护理职业学院'
            ]
            var  yaan = [
              "<strong>"+"<br>"+'四川农业大学',
              "<br>"+'雅安职业技术学院'
            ]
            var  liangshan = [
              "<strong>"+"<br>"+'西昌学院'
            ]
            var  luzhou = [
              "<strong>"+"<br>"+'西南医科大学',
              "<br>"+'四川警察学院',
              "<br>"+'四川化工职业技术学院',
              "<br>"+'泸州职业技术学院',
              "<br>"+'四川三河职业学院'
            ]
            var  nanchong = [
              "<strong>"+"<br>"+'川北医学院',
              "<br>"+'西华师范大学',
              "<br>"+'西南交通大学希望学院',
              "<br>"+'南充职业技术学院'
            ]
            var  neijaing = [
              "<strong>"+"<br>"+'内江师范学院',
              "<br>"+'内江职业技术学院',
              "<br>"+'川南幼儿师范高等专科学校'
            ]
            var  yibin = [
              "<strong>"+"<br>"+'宜宾学院',
              "<br>"+'宜宾职业技术学院'
            ]
            var dazhou  = [
              "<strong>"+"<br>"+'四川文理学院',
              "<br>"+'达州职业技术学院'
            ]
            var  aba = [
              "<strong>"+"<br>"+'阿坝师范学院'
            ]
            var  leshan = [
              "<strong>"+"<br>"+'乐山师范学院',
              "<br>"+'成都理工大学工程技术学院',
              "<br>"+'乐山职业技术学院'
            ]
            var  panshihua = [
              "<strong>"+"<br>"+'攀枝花学院',
              "<br>"+'四川机电职业技术学院'
            ]
            var  ganzi = [
              "<strong>"+"<br>"+'四川民族学院'
            ]
            var  meishan = [
              "<strong>"+"<br>"+'四川大学锦江学院',
              "<br>"+'眉山职业技术学院'
            ]
            var  suining = [
              "<strong>"+"<br>"+'四川职业技术学院'
            ]
            var  guangan = [
              "<strong>"+"<br>"+'广安职业技术学院'
            ]
            var  guangyuan = [
              "<strong>"+"<br>"+'四川信息职业技术学院',
              "<br>"+'川北幼儿师范高等专科学校'
            ]
            var  bazhong = [
              "<strong>"+"<br>"+'巴中职业技术学院'
            ]
            var  guiyang = [
              "<strong>"+"<br>"+'贵州大学',
              "<br>"+'贵州医科大学',
              "<br>"+'贵阳中医学院',
              "<br>"+'贵州师范大学',
              "<br>"+'贵州财经大学',
              "<br>"+'贵州民族大学',
              "<br>"+'贵阳学院',
              "<br>"+'贵州商学院',
              "<br>"+'贵阳中医学院时珍学院',
              "<br>"+'贵州财经大学商务学院',
              "<br>"+'贵州师范学院',
              "<br>"+'贵州理工学院',
              "<br>"+'贵州警察学院',
              "<br>"+'贵州交通职业技术学院',
              "<br>"+'贵州城市职业学院',
              "<br>"+'贵州工业职业技术学院',
              "<br>"+'贵州电力职业技术学院',
              "<br>"+'贵州轻工职业技术学院',
              "<br>"+'贵阳护理职业学院',
              "<br>"+'贵阳职业技术学院',
              "<br>"+'贵州职业技术学院', 
              "<br>"+'贵州工商职业学院',
              "<br>"+'贵阳幼儿师范高等专科学校',
              "<br>"+'贵州建设职业技术学院',
              "<br>"+'贵州电子商务职业技术学院',
              "<br>"+'贵州航空职业技术学院',
              "<br>"+'贵州装备制造职业学院',
              "<br>"+'贵州食品工程职业学院'
            ]
            var  zunyi = [
              "<strong>"+"<br>"+'遵义医学院',
              "<br>"+'遵义师范学院',
              "<br>"+'遵义医学院医学与科技学院',
              "<br>"+'贵州航天职业技术学院',
              "<br>"+'遵义职业技术学院',
              "<br>"+'遵义医药高等专科学校',
              "<br>"+'茅台学院'
            ]
            var  tongren = [
              "<strong>"+"<br>"+'铜仁学院',
              "<br>"+'铜仁职业技术学院',
              "<br>"+'铜仁幼儿师范高等专科学校',
              "<br>"+'贵州工程职业学院',
              "<br>"+'贵州健康职业学院'
            ]
            var qianxi  = [
              "<strong>"+"<br>"+'兴义民族师范学院',
              "<br>"+'黔西南民族职业技术学院'
            ]
            var  anshun = [
              "<strong>"+"<br>"+'安顺学院',
              "<br>"+'安顺职业技术学院'
            ]
            var bijie  = [
              "<strong>"+"<br>"+'贵州工程应用技术学院',
              "<br>"+'毕节职业技术学院',
              "<br>"+'毕节医学高等专科学校',
              "<br>"+'毕节幼儿师范高等专科学校',
              "<br>"+'贵州工贸职业学院'
            ]
            var  liupanshui = [
              "<strong>"+"<br>"+'六盘水师范学院',
              "<br>"+'六盘水职业技术学院'
            ]
            var  xiangtan = [
              "<strong>"+"<br>"+'湘潭大学',
              "<br>"+'湖南科技大学',
              "<br>"+'湖南工程学院',
              "<br>"+'湘潭大学兴湘学院',
              "<br>"+'湖南科技大学潇湘学院',
              "<br>"+'湖南工程学院应用技术学院',
              "<br>"+'湘潭医卫职业技术学院',
              "<br>"+'湖南城建职业技术学院',
              "<br>"+'湖南理工职业技术学院',
              "<br>"+'湖南软件职业学院',
              "<br>"+'湖南电气职业技术学院',
              "<br>"+'湖南国防工业职业技术学院'
            ]
            var  xiangxi = [
              "<strong>"+"<br>"+'吉首大学',
              "<br>"+'湘西民族职业技术学院'
            ]
            var changsha  = [
              "<strong>"+"<br>"+'湖南大学',
              "<br>"+'湖南大学',
              "<br>"+'湖南大学',
              "<br>"+'湖南农业大学',
              "<br>"+'中南林业科技大学',
              "<br>"+'湖南中医药大学',
              "<br>"+'湖南师范大学',
              "<br>"+'湖南商学院',
              "<br>"+'长沙医学院',
              "<br>"+'湖南女子学院',
              "<br>"+'湖南警察学院',
              "<br>"+'湖南财政经济学院',
              "<br>"+'长沙医学院',
              "<br>"+'湖南第一师范学院',
              "<br>"+'湖南涉外经济学院',
              "<br>"+'湖南商学院北津学院',
              "<br>"+'湖南师范大学树达学院',
              "<br>"+'湖南农业大学东方科技学院',
              "<br>"+'中南林业科技大学涉外学院',
              "<br>"+'湖南中医药大学湘杏学院',
              "<br>"+'长沙理工大学城南学院',
              "<br>"+'长沙师范学院',
              "<br>"+'湖南信息学院',
              "<br>"+'长沙民政职业技术学院',
              "<br>"+'湖南工业职业技术学院',
              "<br>"+'湖南信息职业技术学院',
              "<br>"+'湖南税务高等专科学校',
              "<br>"+'长沙航空职业技术学院',
              "<br>"+'湖南大众传媒职业技术学院',
              "<br>"+'湖南科技职业学院',
              "<br>"+'湖南生物机电职业技术学院',
              "<br>"+'湖南交通职业技术学院',
              "<br>"+'湖南商务职业技术学院',
              "<br>"+'湖南体育职业学院',
              "<br>"+'湖南工程职业技术学院',
              "<br>"+'保险职业学院',
              "<br>"+'湖南外贸职业学院',
              "<br>"+'湖南网络工程职业学院'
            ]
            var  yueyang = [
              "<strong>"+"<br>"+'湖南理工学院',
              "<br>"+'湖南理工学院南湖学院',
              "<br>"+'岳阳职业技术学院',
              "<br>"+'湖南石油化工职业技术学院',
              "<br>"+'湖南民族职业学院'
            ]
            var  shanzhou = [
              "<strong>"+"<br>"+'湘南学院',
              "<br>"+'郴州职业技术学院',
              "<br>"+'湘南幼儿师范高等专科学校'
            ]
            var hengyang  = [
              "<strong>"+"<br>"+'衡阳师范学院',
              "<br>"+'南华大学',
              "<br>"+'湖南工学院',
              "<br>"+'南华大学船山学院',
              "<br>"+'衡阳师范学院南岳学院',
              "<br>"+'湖南交通工程学院',
              "<br>"+'湖南环境生物职业技术学院',
              "<br>"+'湖南财经工业职业技术学院',
              "<br>"+'湖南财经工业职业技术学院',
              "<br>"+'湖南工商职业学院'
            ]
            var  shaoyang = [
              "<strong>"+"<br>"+'邵阳学院',
              "<br>"+'邵阳职业技术学院',
              "<br>"+'邵阳职业技术学院'
            ]
            var huaihua  = [
              "<strong>"+"<br>"+'怀化学院',
              "<br>"+'湖南医药学院',
              "<br>"+'湖南医药学院'
            ]
            var  changde = [
              "<strong>"+"<br>"+'湖南文理学院',
              "<br>"+'湖南文理学院芙蓉学院',
              "<br>"+'湖南应用技术学院',
              "<br>"+'湖南应用技术学院',
              "<br>"+'湖南高尔夫旅游职业学院'
            ]
            var  yongzhou = [
              "<strong>"+"<br>"+'湖南科技学院',
              "<br>"+'永州职业技术学院',
              "<br>"+'湖南九嶷职业技术学院'
            ]
            var loudi  = [
              "<strong>"+"<br>"+'湖南人文科技学院',
              "<br>"+'娄底职业技术学院',
              "<br>"+'潇湘职业学院'
            ]
            var  yiyang = [
              "<strong>"+"<br>"+'湖南城市学院',
              "<br>"+'益阳职业技术学院',
              "<br>"+'湖南工艺美术职业学院',
              "<br>"+'益阳医学高等专科学校'
            ]
            var zhuzhou  = [
              "<strong>"+"<br>"+'湖南工业大学',
              "<br>"+'湖南工业大学科技学院',
              "<br>"+'湖南冶金职业技术学院',
              "<br>"+'湖南铁道职业技术学院',
              "<br>"+'湖南铁道职业技术学院',
              "<br>"+'湖南中医药高等专科学校',
              "<br>"+'湖南汽车工程职业学院',
              "<br>"+'湖南铁路科技职业技术学院'
            ]
            var zhangjiajie  = [
              "<strong>"+"<br>"+'吉首大学张家界学院',
              "<br>"+'吉首大学张家界学院'
            ]
            var nanchang  = [
              "<strong>"+"<br>"+'南昌大学',
              "<br>"+'华东交通大学',
              "<br>"+'南昌航空大学',
              "<br>"+'江西农业大学',
              "<br>"+'江西中医药大学',
              "<br>"+'江西师范大学',
              "<br>"+'江西财经大学',
              "<br>"+'江西科技学院',
              "<br>"+'江西科技师范大学',
              "<br>"+'南昌工程学院',
              "<br>"+'江西警察学院',
              "<br>"+'南昌理工学院',
              "<br>"+'江西应用科技学院',
              "<br>"+'江西服装学院',
              "<br>"+'南昌工学院',
              "<br>"+'南昌大学科学技术学院',
              "<br>"+'南昌大学科学技术学院',
              "<br>"+'南昌航空大学科技学院',
              "<br>"+'江西中医药大学科技学院',
              "<br>"+'江西师范大学科学技术学院',
              "<br>"+'江西科技师范大学理工学院',
              "<br>"+'江西财经大学现代经济管理学院',
              "<br>"+'南昌师范学院',
              "<br>"+'江西工业职业技术学院',
              "<br>"+'江西司法警官职业学院',
              "<br>"+'江西旅游商贸职业学院',
              "<br>"+'江西电力职业技术学院',
              "<br>"+'江西艺术职业学院',
              "<br>"+'江西信息应用职业技术学院',
              "<br>"+'江西机电职业技术学院',
              "<br>"+'江西科技职业学院',
              "<br>"+'江西外语外贸职业学院'
            ]
            var fuzhou1  = [
              "<strong>"+"<br>"+'东华理工大学',
              "<br>"+'东华理工大学长江学院',
              "<br>"+'抚州职业技术学院',
              "<br>"+'江西中医药高等专科学校',
              "<br>"+'抚州幼儿师范高等专科学校'
            ]
            var  gongzhou = [
              "<strong>"+"<br>"+'江西理工大学',
              "<br>"+'江西理工大学',
              "<br>"+'赣南师范大学',
              "<br>"+'江西理工大学应用科学学院',
              "<br>"+'赣南师范大学科技学院',
              "<br>"+'江西环境工程职业学院',
              "<br>"+'江西应用技术职业学院',
              "<br>"+'赣州师范高等专科学校'
            ]
            var  jingdezheng = [
              "<strong>"+"<br>"+'景德镇陶瓷大学',
              "<br>"+'景德镇陶瓷大学',
              "<br>"+'景德镇陶瓷大学科技艺术学院',
              "<br>"+'景德镇陶瓷大学科技艺术学院',
              "<br>"+'景德镇陶瓷大学科技艺术学院'
            ]
            var  shangrao = [
              "<strong>"+"<br>"+'上饶师范学院',
              "<br>"+'江西医学高等专科学校',
              "<br>"+'上饶职业技术学院',
              "<br>"+'上饶幼儿师范高等专科学校'
              
            ]
            var  yichun1 = [
              "<strong>"+"<br>"+'宜春学院',
              "<br>"+'宜春职业技术学院',
              "<br>"+'江西农业工程职业学院',
              "<br>"+'宜春幼儿师范高等专科学校',
              "<br>"+'江西洪州职业学院'
            ]
            var jian  = [
              "<strong>"+"<br>"+'井冈山大学',
              "<br>"+'吉安职业技术学院'
            ]
            var  pingxiang = [
              "<strong>"+"<br>"+'萍乡学院',
              "<br>"+'江西工业工程职业技术学院',
              "<br>"+'江西应用工程职业学院'
            ]
            var  xinyu = [
              "<strong>"+"<br>"+'新余学院',
              "<br>"+'新余学院',
              "<br>"+'新余学院',
              "<br>"+'新余学院',
              "<br>"+'江西冶金职业技术学院'
            ]
            var  jiujiang = [
              "<strong>"+"<br>"+'九江学院',
              "<br>"+'南昌大学共青学院',
              "<br>"+'九江职业大学',
              "<br>"+'九江职业技术学院',
              "<br>"+'江西财经职业学院',
              "<br>"+'江西枫林涉外经贸职业学院',
              "<br>"+'共青科技职业学院'
            ]
            var  wuhan = [
              "<strong>"+"<br>"+'武汉大学',
              "<br>"+'华中科技大学',
              "<br>"+'武汉科技大学',
              "<br>"+'武汉工程大学',
              "<br>"+'中国地质大学（武汉）',
              "<br>"+'武汉纺织大学',
              "<br>"+'武汉轻工大学',
              "<br>"+'武汉轻工大学',
              "<br>"+'湖北工业大学',
              "<br>"+'华中农业大学',
              "<br>"+'湖北中医药大学',
              "<br>"+'华中师范大学',
              "<br>"+'湖北大学',
              "<br>"+'中南财经政法大学',
              "<br>"+'武汉体育学院',
              "<br>"+'湖北美术学院',
              "<br>"+'中南民族大学',
              "<br>"+'江汉大学',
              "<br>"+'江汉大学',
              "<br>"+'江汉大学',
              "<br>"+'湖北经济学院',
              "<br>"+'武汉商学院',
              "<br>"+'武汉东湖学院',
              "<br>"+'汉口学院',
              "<br>"+'武昌首义学院',
              "<br>"+'武昌首义学院',
              "<br>"+'武汉生物工程学院',
              "<br>"+'武汉晴川学院',
              "<br>"+'武汉晴川学院',
              "<br>"+'武汉科技大学城市学院',
              "<br>"+'武汉科技大学城市学院',
              "<br>"+'湖北工业大学工程技术学院',
              "<br>"+'武汉工程大学邮电与信息工程学院',
              "<br>"+'武汉纺织大学外经贸学院',
              "<br>"+'武昌工学院',
              "<br>"+'武汉工商学院',
              "<br>"+'湖北商贸学院',
              "<br>"+'湖北经济学院法商学院',
              "<br>"+'湖北经济学院法商学院',
              "<br>"+'文华学院',
              "<br>"+'武汉学院',
              "<br>"+'武汉工程科技学院',
              "<br>"+'武汉华夏理工学院',
              "<br>"+'武汉传媒学院',
              "<br>"+'武汉设计工程学院',
              "<br>"+'湖北第二师范学院',
              "<br>"+'武汉职业技术学院',
              "<br>"+'长江职业学院',
              "<br>"+'武汉城市职业学院',
              "<br>"+'武汉船舶职业技术学院',
              "<br>"+'武汉工贸职业学院',
              "<br>"+'武汉工程职业技术学院',
              "<br>"+'武汉航海职业技术学院',
              "<br>"+'湖北生物科技职业学院',
              "<br>"+'武汉警官职业学院',
              "<br>"+'武汉信息传播职业技术学院',
              "<br>"+'湖北艺术职业学院',
              "<br>"+'武汉商贸职业学院'
            ]
            var  jingzhou1 = [
              "<strong>"+"<br>"+'长江大学',
              "<br>"+'长江大学工程技术学院',
              "<br>"+'长江大学文理学院',
              "<br>"+'长江大学文理学院',
              "<br>"+'荆州职业技术学院',
              "<br>"+'湖北中医药高等专科学校',
              "<br>"+'长江艺术工程职业学院'
            ]
            var  huangshi = [
              "<strong>"+"<br>"+'湖北师范大学',
              "<br>"+'湖北理工学院',
              "<br>"+'湖北师范大学文理学院',
              "<br>"+'湖北工程职业学院'
            ]
            var  huanggang = [
              "<strong>"+"<br>"+'黄冈师范学院',
              "<br>"+'黄冈职业技术学院',
              "<br>"+'鄂东职业技术学院',
              "<br>"+'黄冈科技职业学院'
            ]
            var enshi  = [
              "<strong>"+"<br>"+'湖北民族学院',
              "<br>"+'湖北民族学院科技学院',
              "<br>"+'恩施职业技术学院'
            ]
            var  xiangyang = [
              "<strong>"+"<br>"+'湖北文理学院',
              "<br>"+'湖北文理学院理工学院',
              "<br>"+'襄阳职业技术学院',
              "<br>"+'襄阳汽车职业技术学院'
            ]
            var  xiaogan = [
              "<strong>"+"<br>"+'湖北工程学院',
              "<br>"+'湖北工程学院新技术学院',
              "<br>"+'湖北职业技术学院'
            ]
            var  xiannig = [
              "<strong>"+"<br>"+'湖北科技学院',
              "<br>"+'咸宁职业技术学院'
            ]
            var  shiyan = [
              "<strong>"+"<br>"+'湖北汽车工业学院',
              "<br>"+'湖北医药学院',
              "<br>"+'湖北汽车工业学院科技学院',
              "<br>"+'湖北医药学院药护学院',
              "<br>"+'汉江师范学院',
              "<br>"+'湖北工业职业技术学院'
            ]
            var yichang  = [
              "<strong>"+"<br>"+'三峡大学',
              "<br>"+'三峡大学科技学院',
              "<br>"+'湖北三峡职业技术学院',
              "<br>"+'三峡电力职业学院',
              "<br>"+'三峡旅游职业技术学院'
            ]
            var  ezhou = [
              "<strong>"+"<br>"+'鄂州职业大学'
            ]
            var xiantao  = [
              "<strong>"+"<br>"+'仙桃职业学院'
            ]
            var suizhou  = [
              "<strong>"+"<br>"+'随州职业技术学院'
            ]
            var qianjiang  = [
              "<strong>"+"<br>"+'江汉艺术职业学院'
            ]
            var zhengzhou  = [
              "<strong>"+"<br>"+'河南农业大学',
              "<br>"+'河南牧业经济学院',
              "<br>"+'河南中医药大学',
              "<br>"+'河南财经政法大学',
              "<br>"+'郑州航空工业管理学院',
              "<br>"+'河南工程学院',
              "<br>"+'河南警察学院',
              "<br>"+'黄河科技学院',
              "<br>"+'铁道警察学院',
              "<br>"+'郑州科技学院',
              "<br>"+'郑州工业应用技术学院',
              "<br>"+'郑州师范学院',
              "<br>"+'郑州财经学院',
              "<br>"+'河南师范大学新联学院',
              "<br>"+'郑州工商学院',
              "<br>"+'中原工学院信息商务学院',
              "<br>"+'郑州成功财经学院',
              "<br>"+'郑州升达经贸管理学院',
              "<br>"+'河南职业技术学院',
              "<br>"+'郑州铁路职业技术学院',
              "<br>"+'郑州工程技术学院',
              "<br>"+'河南财政金融学院',
              "<br>"+'郑州电力高等专科学校',
              "<br>"+'河南水利与环境职业学院',
              "<br>"+'河南司法警官职业学院',
              "<br>"+'郑州澍青医学高等专科学校',
              "<br>"+'河南检察职业学院',
              "<br>"+'郑州信息科技职业学院',
              "<br>"+'郑州电子信息职业技术学院',
              "<br>"+'嵩山少林武术职业学院',
              "<br>"+'郑州工业安全职业学院',
              "<br>"+'河南经贸职业学院',
              "<br>"+'河南交通职业技术学院',
              "<br>"+'河南农业职业学院',
              "<br>"+'郑州旅游职业学院',
              "<br>"+'郑州职业技术学院',
              "<br>"+'河南信息统计职业学院',
              "<br>"+'河南工业贸易职业学院',
              "<br>"+'郑州电力职业技术学院',
              "<br>"+'郑州电力职业技术学院',
              "<br>"+'郑州城市职业学院',
              "<br>"+'郑州理工职业学院',
              "<br>"+'郑州理工职业学院'
            ]
            var  jiaozuo = [
              "<strong>"+"<br>"+'河南理工大学',
              "<br>"+'黄河交通学院',
              "<br>"+'焦作大学',
              "<br>"+'焦作大学',
              "<br>"+'焦作师范高等专科学校',
              "<br>"+'焦作工贸职业学院'
            ]
            var luoyang  = [
              "<strong>"+"<br>"+'河南科技大学',
              "<br>"+'洛阳师范学院',
              "<br>"+'洛阳理工学院',
              "<br>"+'河南林业职业学院',
              "<br>"+'河南推拿职业学院',
              "<br>"+'洛阳职业技术学院',
              "<br>"+'洛阳科技职业学院'
            ]
            var xinxiang  = [
              "<strong>"+"<br>"+'河南科技学院',
              "<br>"+'新乡医学院',
              "<br>"+'河南师范大学',
              "<br>"+'新乡学院',
              "<br>"+'新乡医学院三全学院',
              "<br>"+'河南科技学院新科学院',
              "<br>"+'河南工学院',
              "<br>"+'新乡职业技术学院',
              "<br>"+'长垣烹饪职业技术学院'
            ]
            var  kaifeng = [
              "<strong>"+"<br>"+'河南大学',
              "<br>"+'河南大学民生学院',
              "<br>"+'开封大学',
              "<br>"+'黄河水利职业技术学院',
              "<br>"+'开封文化艺术职业学院'
            ]
            var xinyang  = [
              "<strong>"+"<br>"+'信阳师范学院',
              "<br>"+'信阳农林学院',
              "<br>"+'信阳学院',
              "<br>"+'信阳职业技术学院',
              "<br>"+'信阳涉外职业技术学院'
            ]
            var zhoukou  = [
              "<strong>"+"<br>"+'周口师范学院',
              "<br>"+'周口职业技术学院',
              "<br>"+'周口科技职业学院'
            ]
            var anyang  = [
              "<strong>"+"<br>"+'安阳师范学院',
              "<br>"+'安阳工学院',
              "<br>"+'安阳学院',
              "<br>"+'安阳职业技术学院',
              "<br>"+'河南护理职业学院',
              "<br>"+'安阳幼儿师范高等专科学校'
            ]
            var  xuchang = [
              "<strong>"+"<br>"+'许昌学院',
              "<br>"+'许昌职业技术学院',
              "<br>"+'许昌陶瓷职业学院',
              "<br>"+'许昌电气职业学院'
            ]
            var nanyang  = [
              "<strong>"+"<br>"+'南阳师范学院',
              "<br>"+'南阳理工学院',
              "<br>"+'河南工业职业技术学院',
              "<br>"+'南阳医学高等专科学校',
              "<br>"+'南阳职业学院',
              "<br>"+'南阳农业职业学院'
            ]
            var  shangqiu = [
              "<strong>"+"<br>"+'商丘师范学院',
              "<br>"+'商丘工学院',
              "<br>"+'商丘学院',
              "<br>"+'商丘职业技术学院',
              "<br>"+'商丘医学高等专科学校',
              "<br>"+'永城职业学院'
            ]
            var  zhumadian = [
              "<strong>"+"<br>"+'黄淮学院',
              "<br>"+'驻马店职业技术学院',
              "<br>"+'驻马店幼儿师范高等专科学校'
            ]
            var  pingdingshan = [
              "<strong>"+"<br>"+'平顶山学院',
              "<br>"+'河南城建学院',
              "<br>"+'平顶山工业职业技术学院',
              "<br>"+'平顶山工业职业技术学院',
              "<br>"+'平顶山文化艺术职业学院'
            ]
            var  luohe = [
              "<strong>"+"<br>"+'漯河职业技术学院',
              "<br>"+'漯河医学高等专科学校',
              "<br>"+'漯河食品职业学院'
            ]
            var  sanmengxia = [
              "<strong>"+"<br>"+'三门峡职业技术学院',
              "<br>"+'三门峡社会管理职业学院'
            ]
            var puyang  = [
              "<strong>"+"<br>"+'濮阳职业技术学院',
              "<br>"+'濮阳医学高等专科学校'
            ]
            var jiyuan  = [
              "<strong>"+"<br>"+'济源职业技术学院'
            ]
            var hebi  = [
              "<strong>"+"<br>"+'鹤壁职业技术学院',
              "<br>"+'鹤壁职业技术学院',
              "<br>"+'鹤壁能源化工职业学院'
            ]
          
            //北京
            
            var haidianqu  = [
              "<strong>"+"<br>"+'北京大学',
              "<br>"+'清华大学',
              "<br>"+'中国人民大学',
              "<br>"+'北京交通大学',
              "<br>"+'北京航空航天大学',
              "<br>"+'北京理工大学',
              "<br>"+'北京科技大学',
              "<br>"+'北京化工大学',
              "<br>"+'北京工商大学',
              "<br>"+'北京服装学院',
              "<br>"+'北京邮电大学',
              "<br>"+'中国农业大学',
              "<br>"+'北京林业大学',
              "<br>"+'中国科学院大学',
              "<br>"+'中国社会科学院大学',
              "<br>"+'中国劳动关系学院',
              "<br>"+'中国青年政治学院',
              "<br>"+'北京联合大学',
              "<br>"+'中国地质大学',
              "<br>"+'中国矿业大学',
              "<br>"+'北京信息科技大学',
              "<br>"+'北京电影学院',
              "<br>"+'北京舞蹈学院',
              "<br>"+'中国政法大学',
              "<br>"+'北京中医药大学',
              "<br>"+'首都师范大学',
              "<br>"+'首都体育学院',
              "<br>"+'北京外国语大学',
              "<br>"+'中央财经大学'
            ]
            var zhaoyangqu  = [
              "<strong>"+"<br>"+'北京工业大学',
              "<br>"+'北京科技大学',
              "<br>"+'北京化工大学',
              "<br>"+'北京服装学院',
              "<br>"+'北京中医药大学',
              "<br>"+'中央音乐学院',
              "<br>"+'中国音乐学院',
              "<br>"+'中央美术学院',
              "<br>"+'中华女子学院',
              "<br>"+'对外经济贸易大学',
              "<br>"+'北京信息科技大学',
              "<br>"+'中国青年政治学院',
              "<br>"+'中国社会科学院大学',
              ]
              var changpingqu  = [
              "<strong>"+"<br>"+'北京航空航天大学',
              "<br>"+'北京化工大学',
              "<br>"+'北京服装学院',
              "<br>"+'北京邮电大学',
              "<br>"+'北京农学院',
              "<br>"+'北京师范大学',
              "<br>"+'中央戏曲学院',
              "<br>"+'首都经济贸易大学',
              "<br>"+'华北电力大学',
              ]
              var shijingshanqu  = [
              "<strong>"+"<br>"+'北方工业大学',
              "<br>"+'首钢工学院'
              ]
              var fangshanqu  = [
              "<strong>"+"<br>"+'北京理工大学',
              "<br>"+'北京工商大学',
              "<br>"+'北京石油化工学院',
              "<br>"+'北京中医药大学',
              "<br>"+'首都师范大学',
              "<br>"+'中国社会科学院大学'
              ]
              var daxingqu  = [
              "<strong>"+"<br>"+'中国人民公安大学',
              "<br>"+'北京石油化工学院',
              "<br>"+'北京建筑大学',
              "<br>"+'北京印刷学院'
              ]
              var xichengqu  = [
              "<strong>"+"<br>"+'北京建筑大学',
              "<br>"+'北京师范大学',
              "<br>"+'外交学院',
              "<br>"+'中国人民公安大学',
              "<br>"+'中央音乐学院'
              ]
              var fengtaiqu  = [
              "<strong>"+"<br>"+'北京电子科技学院',
              "<br>"+'首都医科大学',
              "<br>"+'首都经济贸易大学',
              "<br>"+'中国音乐学院',
              "<br>"+'中国戏曲学院',
              "<br>"+'北京联合大学'
              ]
              var dongchengqu  = [
              "<strong>"+"<br>"+'北京协和医学院',
              "<br>"+'中央戏曲学院'
              ]
              var tongzhouqu  = [
              "<strong>"+"<br>"+'北京工业大学',
              "<br>"+'北京物质学院'
              ]
              var yanqingqu  = [
              "<strong>"+"<br>"+'北京第二外国语学院',
              "<br>"+'北京邮电大学世纪学院'
              ]
              var miyunqu  = [
              "<strong>"+"<br>"+'首都经济贸易大学',
              
              ]
              var huairouqu = [
              "<strong>"+"<br>"+'中国科学院大学'
              ]
              var shunyiqu  = [
              "<strong>"+"<br>"+'北京工业大学耿丹学院',
              "<br>"+'北京城市学院'
              ]
            
              //重庆
              var gaoxinqu  = [
              "<strong>"+"<br>"+'重庆大学虎溪校区',
              "<br>"+'重庆医科大学缙云校区',
              "<br>"+'四川美术学院虎溪校区',
              "<br>"+'重庆师范大学虎溪校区',
              "<br>"+'重庆科技学院',
              "<br>"+'陆军军医大学虎溪校区',
              "<br>"+'重庆警察学院',
              "<br>"+'陆军勤务学院'
              ]
              var shapingbaqu  = [
              "<strong>"+"<br>"+'重庆大学',
              "<br>"+'重庆师范大学',
              "<br>"+'四川外国语大学',
              "<br>"+'陆军工程大学通信士官学校',
              "<br>"+'陆军军医大学',
              "<br>"+'西南政法大学'
              ]
              var nananqu  = [
              "<strong>"+"<br>"+'重庆邮电大学',
              "<br>"+'重庆工商大学',
              "<br>"+'重庆交通大学',
              "<br>"+'重庆第二师范学院'
              ]
              var jiulongpuqu  = [
              "<strong>"+"<br>"+'四川美术学院',
              "<br>"+'重庆科技职业学院',
              "<br>"+'重庆文化艺术职业学院',
              "<br>"+'重庆资源与环境保护职业学院',
              "<br>"+'重庆资源与环境保护职业学院',
              "<br>"+'中国人民解放军陆军军医大学（第三军医大学）',
              "<br>"+'中国人民解放军陆军勤务学院',
              ]
              var beipeiqu  = [
              "<strong>"+"<br>"+'西南大学',
              "<br>"+'重庆财经职业学院',
              "<br>"+'重庆财经职业学院',
              "<br>"+'重庆财经职业学院',
              "<br>"+'重庆财经职业学院',
              "<br>"+'重庆财经职业学院',
              ]
              var bananqu  = [
              "<strong>"+"<br>"+'重庆理工大学',
              "<br>"+'重庆财经学院',
              "<br>"+'重庆工程学院'
              ]
              var yubeiqu  = [
              "<strong>"+"<br>"+'西南政法大学',
              "<br>"+'重庆外语外事学院',
              "<br>"+'重庆理工大学两江校区'
              ]
              var yuzhongqu  = [
              "<strong>"+"<br>"+'重庆医科大学',
              "<br>"+'重庆艺术工程职业学院',
              "<br>"+'重庆经贸职业学院',
              "<br>"+'重庆经贸职业学院', 
              "<br>"+'重庆科创职业学院',
              ]
              var wanzhouqu  = [
              "<strong>"+"<br>"+'重庆三峡学院'
              ]
              var peilingxian  = [
              "<strong>"+"<br>"+'长江师范学院',
              "<br>"+'重庆化工职业学院',
              "<br>"+'重庆旅游职业学院',
              "<br>"+'重庆安全技术职业学院',
              ]
              var yongchuan  = [
              "<strong>"+"<br>"+'重庆文理学院',
              "<br>"+'重庆公共运输职业学院',
              "<br>"+'重庆艺术工程职业学院',
              "<br>"+'重庆艺术工程职业学院',
              ]
              var jiangjing  = [
              "<strong>"+"<br>"+'重庆交通大学双福校区',
              "<br>"+'西南大学荣昌校区'
              ]


              var hexiqu  = [
              "<br>"+'天津医科大学',
              "<br>"+'天津中医药大学',
              "<br>"+'天津师范大学',
              "<br>"+'天津职业技术师范大学',
              "<br>"+'天津外国语大学',
              "<br>"+'天津城建大学',
              "<br>"+'天津天狮学院',
              "<br>"+'天津外国语大学滨海外事学院',
              ]
              var hedongqu  = [
              "<br>"+'天津外国语大学',
              "<br>"+'天津财经大学',
              "<br>"+'天津体育学院',
              "<br>"+'天津音乐学院',
              "<br>"+'天津音乐学院',
              ]
              var nankaiqu  = [
              "<strong>"+"<br>"+'南开大学',
              "<br>"+'天津大学',
              "<br>"+'天津科技大学',
              "<br>"+'天津科技大学',
              "<br>"+'中国民航大学',
              "<br>"+'中国民航大学',
              "<br>"+'天津农学院',
              ]
              var beichegnqu  = [
              "<strong>"+"<br>"+'天津体育学院运动与文化艺术学院',
              "<br>"+'天津商业大学宝德学院',
              "<br>"+'天津医科大学临床医学院',
              "<br>"+'南开大学滨海学院',
              "<br>"+'天津师范大学津沽学院',
              "<br>"+'天津理工大学中环信息学院',
              "<br>"+'北京科技大学天津学院'
              ]
              var wuqingqu  = [
              "<br>"+'天津中德应用技术大学',
              "<br>"+'天津中德应用技术大学',
              "<br>"+'天津中德应用技术大学',
              "<br>"+'天津中德应用技术大学',
              "<br>"+'天津渤海职业技术学院',
              "<br>"+'天津渤海职业技术学院',
              ]
              var jingnanqu  = [
              "<br>"+'天津开发区职业技术学院',
              "<br>"+'天津艺术职业学院',
              "<br>"+'天津交通职业学院',
              "<br>"+'天津冶金职业技术学院',
              "<br>"+'天津石油职业技术学院',
              "<br>"+'中国人民武装警察部队后勤学院',
              "<br>"+'中国人民解放军陆军军事交通学院',
              ] 
              var binghaixqu  = [
              "<br>"+'天津机电职业技术学院',
              "<br>"+'天津机电职业技术学院',
              "<br>"+'天津公安警官职业学院',
              "<br>"+'天津轻工职业技术学院',
              ] 
              var baodiqu  = [
              "<strong>"+"<br>"+'',
                "<br>"+'天津大学仁爱学院',
              "<br>"+'天津大学仁爱学院',
              "<br>"+'天津大学仁爱学院',
             
              "<br>"+'天津商务职业学院',
              "<br>"+'天津国土资源和房屋职业学院',
              "<br>"+'天津医学高等专科学校',     
              ] 
              var dongliqu  = [
              "<strong>"+"<br>"+'',
                "<br>"+'中国人民武装警察部队后勤学院',
              "<br>"+'中国人民解放军海军勤务学院',
              "<br>"+'天津体育职业学院',
              "<br>"+'天津工艺美术职业学院',
              "<br>"+'天津广播影视职业学院',
              "<br>"+'天津城市建设管理职业技术学院',
              "<br>"+'天津城市职业学院'
              ] 




















            if(params.name==='浦东新区'){
               return params.name + '：' + (params.value ||  pudongxinqu)
            }else if(params.name==='崇明县'){
               return params.name + '：' + (params.value ||  chongming)
            }else if(params.name==='金山区'){
               return params.name + '：' + (params.value ||  jinshan)
            }else if(params.name==='奉贤区'){
               return params.name + '：' + (params.value ||  fengxian)
            }else if(params.name==='松江区'){
               return params.name + '：' + (params.value ||  songjiang)
            }else if(params.name==='青浦区'){
               return params.name + '：' + (params.value ||  qingpu)
            }else if(params.name==='嘉定区'){
               return params.name + '：' + (params.value ||  jiading)
            }else if(params.name==='宝山区'){
               return params.name + '：' + (params.value ||  baoshan)
            }else if(params.name==='闵行区'){
               return params.name + '：' + (params.value ||  minhang)
            }else if(params.name==='徐汇区'){
               return params.name + '：' + (params.value ||  xuhui)
            }else if(params.name==='长宁区'){
               return params.name + '：' + (params.value ||  changning)
            }else if(params.name==='普陀区'){
               return params.name + '：' + (params.value ||  putuo)
            }else if(params.name==='静安区'){
               return params.name + '：' + (params.value ||  jingan)
            }else if(params.name==='黄浦区'){
               return params.name + '：' + (params.value ||  huangpu)
            }else if(params.name==='虹口区'){
               return params.name + '：' + (params.value ||  hongkou)
            }else if(params.name==='杨浦区'){
               return params.name + '：' + (params.value ||  yangpu)
            }else if(params.name==='合肥市'){
               return params.name + '：' + (params.value ||  anhui)
            }else if(params.name==='亳州市'){
               return params.name + '：' + (params.value ||  bozhou)
            }else if(params.name==='阜阳市'){
               return params.name + '：' + (params.value ||  fuyang)
            }else if(params.name==='宿州市'){
               return params.name + '：' + (params.value ||  suzhou)
            }else if(params.name==='淮北市'){
               return params.name + '：' + (params.value ||  huaibei)
            }else if(params.name==='蚌埠市'){
               return params.name + '：' + (params.value ||  bengbu)
            }else if(params.name==='淮南市'){
               return params.name + '：' + (params.value ||  huainan)
            }else if(params.name==='六安市'){
               return params.name + '：' + (params.value ||  liuan)
            }else if(params.name==='安庆市'){
               return params.name + '：' + (params.value ||  anqing)
            }else if(params.name==='池州市'){
               return params.name + '：' + (params.value ||  chizhou)
            }else if(params.name==='黄山市'){
               return params.name + '：' + (params.value ||  huangshan)
            }else if(params.name==='铜陵市'){
               return params.name + '：' + (params.value ||  tongling)
            }else if(params.name==='宣城市'){
               return params.name + '：' + (params.value ||  xuancheng)
            }else if(params.name==='芜湖市'){
               return params.name + '：' + (params.value ||  wuhu)
            }else if(params.name==='马鞍山市'){
               return params.name + '：' + (params.value ||  maanshan)
            }else if(params.name==='滁州市'){
               return params.name + '：' + (params.value ||  chuzhou)
            }else if(params.name==='杭州市'){
               return params.name + '：' + (params.value ||  hangzhou)
            }else if(params.name==='徐州市'){
               return params.name + '：' + (params.value ||  xuzhou )
            }else if(params.name==='南通市'){
               return params.name + '：' + (params.value ||  nantong )
            }else if(params.name==='连云港市'){
               return params.name + '：' + (params.value ||  lianyungang )
            }else if(params.name==='苏州市'){
               return params.name + '：' + (params.value ||  suzhou )
            }else if(params.name==='南京市'){
               return params.name + '：' + (params.value ||  nanjin )
            }else if(params.name==='常州市'){
               return params.name + '：' + (params.value ||  changzhou )
            }else if(params.name==='泰州市'){
               return params.name + '：' + (params.value ||  taizhou2 )
            }else if(params.name==='无锡市'){
               return params.name + '：' + (params.value ||  wuxi )
            }else if(params.name==='扬州市'){
               return params.name + '：' + (params.value ||  yangzhou )
            }else if(params.name==='镇江市'){
               return params.name + '：' + (params.value ||  zhengjiang )
            }else if(params.name==='宿迁市'){
               return params.name + '：' + (params.value ||  suqian )
            }else if(params.name==='淮安市'){
               return params.name + '：' + (params.value ||  huaian )
            }else if(params.name==='盐城市'){
               return params.name + '：' + (params.value ||  yancheng )
            
            }else if(params.name==='南平市'){
               return params.name + '：' + (params.value ||  nanpin )
            }else if(params.name==='宁德市'){
               return params.name + '：' + (params.value ||  ningde )
            }else if(params.name==='福州市'){
               return params.name + '：' + (params.value ||  fuzhou )
            }else if(params.name==='莆田市'){
               return params.name + '：' + (params.value ||  putian )
            }else if(params.name==='漳州市'){
               return params.name + '：' + (params.value ||  zhangzhou )
            }else if(params.name==='龙岩市'){
               return params.name + '：' + (params.value ||  longyan )
            }else if(params.name==='三明市'){
               return params.name + '：' + (params.value ||  sanming )
            }else if(params.name==='泉州市'){
               return params.name + '：' + (params.value ||  quanzhou )
            }else if(params.name==='厦门市'){
               return params.name + '：' + (params.value ||  xiamen )
            }

            else if(params.name==='韶关市'){
               return params.name + '：' + (params.value ||  shaoguan )
            }else if(params.name==='河源市'){
               return params.name + '：' + (params.value ||  heyuan )
            }else if(params.name==='梅州市'){
               return params.name + '：' + (params.value ||  meizhou )
            }else if(params.name==='潮州市'){
               return params.name + '：' + (params.value ||  chaozhou )
            }else if(params.name==='汕头市'){
               return params.name + '：' + (params.value ||  shantou )
            }else if(params.name==='揭阳市'){
               return params.name + '：' + (params.value ||  jieyang )
            }else if(params.name==='惠州市'){
               return params.name + '：' + (params.value ||  huizhou )
            }else if(params.name==='广州市'){
               return params.name + '：' + (params.value ||  guangzhou )
            }else if(params.name==='清远市'){
               return params.name + '：' + (params.value ||  qingyua )
            }else if(params.name==='东菀市'){
               return params.name + '：' + (params.value ||  donghuan )
            }else if(params.name==='深圳市'){
               return params.name + '：' + (params.value ||  shenzheng )
            }else if(params.name==='肇庆市'){
               return params.name + '：' + (params.value ||  zhaoqing )
            }else if(params.name==='云浮市'){
               return params.name + '：' + (params.value ||  yunfu )
            }else if(params.name==='佛山市'){
               return params.name + '：' + (params.value ||  fuzhou )
            }else if(params.name==='中山市'){
               return params.name + '：' + (params.value ||  zhongshan )
            }else if(params.name==='珠海市'){
               return params.name + '：' + (params.value ||  zhuhai )
            }else if(params.name==='江门市'){
               return params.name + '：' + (params.value ||  jiangmen )
            }else if(params.name==='茂名市'){
               return params.name + '：' + (params.value ||  maomin )
            }else if(params.name==='阳江市'){
               return params.name + '：' + (params.value ||  yangjiang )
            }else if(params.name==='湛江市'){
               return params.name + '：' + (params.value ||  zhanjiang )
            }else if(params.name==='汕尾市'){
               return params.name + '：' + (params.value ||  shanwei )
            
            }else if(params.name==='海口市'){
               return params.name + '：' + (params.value ||  haikou )
            }else if(params.name==='三亚市'){
               return params.name + '：' + (params.value ||  sanya )
            }else if(params.name==='琼海市'){
               return params.name + '：' + (params.value ||  qionghai )
            }else if(params.name==='文昌市'){
               return params.name + '：' + (params.value ||  wenchang )
            
            }else if(params.name==='莱芜市'){
               return params.name + '：' + (params.value ||  laiwu )
            }else if(params.name==='东营市'){
               return params.name + '：' + (params.value ||  dongyin ) 
            }else if(params.name==='威海市'){
               return params.name + '：' + (params.value ||  weihai )
            }else if(params.name==='烟台市'){
               return params.name + '：' + (params.value ||  yantai ) 
            }else if(params.name==='青岛市'){
               return params.name + '：' + (params.value ||  qingdao )
            }else if(params.name==='潍坊市'){
               return params.name + '：' + (params.value ||  weifang ) 
            }else if(params.name==='滨州市'){
               return params.name + '：' + (params.value ||  bingzhou )
            }else if(params.name==='淄博市'){
               return params.name + '：' + (params.value ||  zibo ) 
            }else if(params.name==='济南市'){
               return params.name + '：' + (params.value ||  jinan )
            }else if(params.name==='德州市'){
               return params.name + '：' + (params.value ||  dezhou ) 
            }else if(params.name==='聊城市'){
               return params.name + '：' + (params.value || liaocheng  )
            }else if(params.name==='泰安市'){
               return params.name + '：' + (params.value ||  taian ) 
            }else if(params.name==='菏泽市'){
               return params.name + '：' + (params.value ||  heze )
            }else if(params.name==='济宁市'){
               return params.name + '：' + (params.value ||  jining ) 
            }else if(params.name==='枣庄市'){
               return params.name + '：' + (params.value ||  zaozhaung )
            }else if(params.name==='临沂市'){
               return params.name + '：' + (params.value ||  linyi ) 
            }else if(params.name==='日照市'){
               return params.name + '：' + (params.value ||  rizhao ) 
            

            }else if(params.name==='承德市'){
               return params.name + '：' + (params.value ||  chengde ) 
            }else if(params.name==='唐山市'){
               return params.name + '：' + (params.value ||  tangshan ) 
            }else if(params.name==='张家口市'){
               return params.name + '：' + (params.value ||  zhangjiakou ) 
            }else if(params.name==='保定市'){
               return params.name + '：' + (params.value ||  baoding ) 
            }else if(params.name==='石家庄市'){
               return params.name + '：' + (params.value ||  shijiazhuang ) 
            }else if(params.name==='邢台市'){
               return params.name + '：' + (params.value ||  xingtai ) 
            }else if(params.name==='邯郸市'){
               return params.name + '：' + (params.value ||  handan ) 
            }else if(params.name==='衡水市'){
               return params.name + '：' + (params.value ||  hengshui ) 
            }else if(params.name==='沧州市'){
               return params.name + '：' + (params.value ||  cangzhou ) 
            }else if(params.name==='廊坊市'){
               return params.name + '：' + (params.value ||  langfang ) 
            }else if(params.name==='秦皇岛市'){
               return params.name + '：' + (params.value ||  qinghuangdao ) 
            

            }else if(params.name==='铁岭市'){
               return params.name + '：' + (params.value ||  tieling ) 
            }else if(params.name==='抚顺市'){
               return params.name + '：' + (params.value ||  fushun ) 
            }else if(params.name==='本溪市'){
               return params.name + '：' + (params.value ||  benxi ) 
            }else if(params.name==='沈阳市'){
               return params.name + '：' + (params.value ||  shenyang ) 
            }else if(params.name==='辽阳市'){
               return params.name + '：' + (params.value ||  liaoyang ) 
            }else if(params.name==='鞍山市'){
               return params.name + '：' + (params.value ||  anshan ) 
            }else if(params.name==='营口市'){
               return params.name + '：' + (params.value ||  yingkou ) 
            }else if(params.name==='丹东市'){
               return params.name + '：' + (params.value ||  dandong ) 
            }else if(params.name==='大连市'){
               return params.name + '：' + (params.value ||  dalian ) 
            }else if(params.name==='葫芦岛市'){
               return params.name + '：' + (params.value ||  huludao ) 
            }else if(params.name==='锦州市'){
               return params.name + '：' + (params.value ||  jingzhou ) 
            }else if(params.name==='朝阳市'){
               return params.name + '：' + (params.value ||  chaoyang ) 
            }else if(params.name==='阜新市'){
               return params.name + '：' + (params.value ||  fuxing ) 
            }else if(params.name==='盘锦市'){
               return params.name + '：' + (params.value ||  panjing ) 
            
            
            }else if(params.name==='白城市'){
               return params.name + '：' + (params.value ||  baicheng ) 
            }else if(params.name==='松原市'){
               return params.name + '：' + (params.value ||  songyuan )             
            }else if(params.name==='长春市'){
               return params.name + '：' + (params.value ||  changchun ) 
            }else if(params.name==='吉林市'){
               return params.name + '：' + (params.value ||  jilin ) 
            }else if(params.name==='四平市'){
               return params.name + '：' + (params.value ||  siping ) 
            }else if(params.name==='辽源市'){
               return params.name + '：' + (params.value ||  liaoyuan ) 
            }else if(params.name==='白山市'){
               return params.name + '：' + (params.value ||  baishan ) 
            }else if(params.name==='通化市'){
               return params.name + '：' + (params.value ||  tonghua ) 
            }else if(params.name==='延边朝鲜族自治区'){
               return params.name + '：' + (params.value ||  yanbian ) 
            

            }else if(params.name==='大庆安岭市'){
               return params.name + '：' + (params.value || daxinganlin  ) 
            }else if(params.name==='黑河市'){
               return params.name + '：' + (params.value || heihe  ) 
            }else if(params.name==='伊春市'){
               return params.name + '：' + (params.value || yichun  ) 
            }else if(params.name==='齐齐哈尔市'){
               return params.name + '：' + (params.value || qiqihaer  ) 
            }else if(params.name==='大庆市'){
               return params.name + '：' + (params.value || daqing  ) 
            }else if(params.name==='绥化市'){
               return params.name + '：' + (params.value || suihua  ) 
            }else if(params.name==='哈尔滨市'){
               return params.name + '：' + (params.value || haerbing  ) 
            }else if(params.name==='牡丹江市'){
               return params.name + '：' + (params.value || mudanjiang  ) 
            }else if(params.name==='鸡西市'){
               return params.name + '：' + (params.value || jixi  ) 
            }else if(params.name==='七台河市'){
               return params.name + '：' + (params.value || qitaihe  ) 
            }else if(params.name==='双鸭山市'){
               return params.name + '：' + (params.value || shuangyashan  ) 
            }else if(params.name==='佳木斯市'){
               return params.name + '：' + (params.value || jiamusi  ) 
            }else if(params.name==='鹤岗市'){
               return params.name + '：' + (params.value || hegang  ) 
            

            }else if(params.name==='呼伦贝尔市'){
               return params.name + '：' + (params.value || hulunbeier  ) 
            }else if(params.name==='兴安盟'){
               return params.name + '：' + (params.value || anxingmeng  ) 
            }else if(params.name==='通辽市'){
               return params.name + '：' + (params.value || tongliao  ) 
            }else if(params.name==='赤峰市'){
               return params.name + '：' + (params.value || chifeng  ) 
            }else if(params.name==='锡林郭勒盟'){
               return params.name + '：' + (params.value || xilin  ) 
            }else if(params.name==='乌兰察布布'){
               return params.name + '：' + (params.value || wulanchabubu  ) 
            }else if(params.name==='呼和浩特市'){
               return params.name + '：' + (params.value || huhehaote  ) 
            }else if(params.name==='包头市'){
               return params.name + '：' + (params.value || baotou  ) 
            }else if(params.name==='鄂尔多斯市'){
               return params.name + '：' + (params.value || eerduosi  ) 
            }else if(params.name==='巴彦'){
               return params.name + '：' + (params.value || bayan  ) 
            }else if(params.name==='乌海市'){
               return params.name + '：' + (params.value || wuhai  ) 
            }else if(params.name==='阿拉善盟'){
               return params.name + '：' + (params.value || alashanmeng  ) 
            
            
            }else if(params.name==='大同市'){
               return params.name + '：' + (params.value || datong  ) 
            }else if(params.name==='朔州市'){
               return params.name + '：' + (params.value || suzhou  ) 
            }else if(params.name==='忻州市'){
               return params.name + '：' + (params.value || xinzhou  ) 
            }else if(params.name==='太原市'){
               return params.name + '：' + (params.value || taiyuan   ) 
            }else if(params.name==='阳泉市'){
               return params.name + '：' + (params.value || yangquan  ) 
            }else if(params.name==='晋中市'){
               return params.name + '：' + (params.value || jinzhou  ) 
            }else if(params.name==='长治市'){
               return params.name + '：' + (params.value || changzhi  ) 
            }else if(params.name==='临沂市'){
               return params.name + '：' + (params.value || linyi  ) 
            }else if(params.name==='运城市'){
               return params.name + '：' + (params.value || yuncheng  ) 
            }else if(params.name==='吕梁市'){
               return params.name + '：' + (params.value || lvliang  ) 
            }else if(params.name==='晋城市'){
               return params.name + '：' + (params.value || jincheng  ) 
               
            
            }else if(params.name==='榆林市'){
               return params.name + '：' + (params.value || yulin  ) 
            }else if(params.name==='延安市'){
               return params.name + '：' + (params.value || yanan  ) 
            }else if(params.name==='铜川市'){
               return params.name + '：' + (params.value || tongchuan  ) 
            }else if(params.name==='渭南市'){
               return params.name + '：' + (params.value || weinan  ) 
            }else if(params.name==='商洛市'){
               return params.name + '：' + (params.value || shangluo  ) 
            }else if(params.name==='安康市'){
               return params.name + '：' + (params.value || ankang  ) 
            }else if(params.name==='汉中市'){
               return params.name + '：' + (params.value || hanzhong  ) 
            }else if(params.name==='宝鸡市'){
               return params.name + '：' + (params.value || baoji  ) 
            }else if(params.name==='咸阳市'){
               return params.name + '：' + (params.value || xianyang  ) 
            }else if(params.name==='西安市'){
               return params.name + '：' + (params.value || xian  ) 
            
            
            }else if(params.name==='银川市'){
               return params.name + '：' + (params.value || yingchuan  ) 
            }else if(params.name==='石嘴山市'){
               return params.name + '：' + (params.value || shizuishan  ) 
            }else if(params.name==='吴忠市'){
               return params.name + '：' + (params.value || wuzhong  ) 
            }else if(params.name==='固原市'){
               return params.name + '：' + (params.value || guyuan  ) 
            
            }else if(params.name==='嘉峪关市'){
               return params.name + '：' + (params.value || jiagugaun  ) 
            }else if(params.name==='酒泉市'){
               return params.name + '：' + (params.value || jiuquan  ) 
            }else if(params.name==='张掖市'){
               return params.name + '：' + (params.value || zhangye  ) 
            }else if(params.name==='金昌市'){
               return params.name + '：' + (params.value || jinchang  ) 
            }else if(params.name==='武威市'){
               return params.name + '：' + (params.value || wuwei  ) 
            }else if(params.name==='白银市'){
               return params.name + '：' + (params.value ||  baiyin ) 
            }else if(params.name==='兰州市'){
               return params.name + '：' + (params.value || lanzhou  ) 
            }else if(params.name==='定西市'){
               return params.name + '：' + (params.value || dingxi  ) 
            }else if(params.name==='天水市'){
               return params.name + '：' + (params.value || tianshui  ) 
            }else if(params.name==='陇南市'){
               return params.name + '：' + (params.value || longnan  ) 
            }else if(params.name==='平凉市'){
               return params.name + '：' + (params.value || pingliang  ) 
            }else if(params.name==='庆阳市'){
               return params.name + '：' + (params.value || qingyang  ) 
             
             
            }else if(params.name==='西宁市'){
               return params.name + '：' + (params.value || xining  ) 
            }else if(params.name==='海东市'){
               return params.name + '：' + (params.value || haidong  ) 
            }else if(params.name==='海西蒙古族'){
               return params.name + '：' + (params.value || haiximenggu  ) 
            
            }else if(params.name==='乌鲁木齐市'){
               return params.name + '：' + (params.value || wulumuqi  ) 
            }else if(params.name==='哈密市'){
               return params.name + '：' + (params.value || hami  ) 
            }else if(params.name==='吐鲁番市'){
               return params.name + '：' + (params.value || tulufan  ) 
            }else if(params.name==='伊犁哈萨克'){
               return params.name + '：' + (params.value || yili  ) 
            }else if(params.name==='石河子市'){
               return params.name + '：' + (params.value || shihezi  ) 
            }else if(params.name==='五家渠市'){
               return params.name + '：' + (params.value || wujiaqu  ) 
            }else if(params.name==='巴音'){
               return params.name + '：' + (params.value || baying  ) 
            }else if(params.name==='阿克苏地区'){
               return params.name + '：' + (params.value ||  akesu ) 
            }else if(params.name==='昌吉'){
               return params.name + '：' + (params.value || changji  ) 
            }else if(params.name==='克拉玛依市'){
               return params.name + '：' + (params.value || kelamayi  ) 
            }else if(params.name==='和田地区'){
               return params.name + '：' + (params.value || hetiandiq  ) 
            }else if(params.name==='阿拉尔市'){
               return params.name + '：' + (params.value || alaer  ) 
          
          
            }else if(params.name==='林芝市'){
               return params.name + '：' + (params.value || linzhi  ) 
            }else if(params.name==='拉萨市'){
               return params.name + '：' + (params.value || lasa  ) 
            }else if(params.name==='咸阳市'){
               return params.name + '：' + (params.value || xianyang2  ) 
             
            
            }else if(params.name==='昆明市'){
               return params.name + '：' + (params.value || kunming  ) 
            }else if(params.name==='大理白族'){
               return params.name + '：' + (params.value || dalibaizu  ) 
            }else if(params.name==='昭通市'){
               return params.name + '：' + (params.value || shaotong  ) 
            }else if(params.name==='曲靖市'){
               return params.name + '：' + (params.value || qujing  ) 
            }else if(params.name==='普洱市'){
               return params.name + '：' + (params.value || puer  ) 
            }else if(params.name==='保山市'){
               return params.name + '：' + (params.value || baoshan1  ) 
            }else if(params.name==='红海哈尼族'){
               return params.name + '：' + (params.value || honghe  ) 
            }else if(params.name==='玉溪市'){
               return params.name + '：' + (params.value || yuxi  ) 
            }else if(params.name==='楚雄'){
               return params.name + '：' + (params.value || chuxiong  ) 
            }else if(params.name==='文山壮族'){
               return params.name + '：' + (params.value || wenshan  ) 
            }else if(params.name==='丽江市'){
               return params.name + '：' + (params.value || lijiang  ) 
            }else if(params.name==='临沧市'){
               return params.name + '：' + (params.value || lincang  ) 
            }else if(params.name==='保山市'){
               return params.name + '：' + (params.value || baoshan  ) 
            }else if(params.name==='德宏'){
               return params.name + '：' + (params.value || dehong  ) 
              
              
            }else if(params.name==='南宁市'){
               return params.name + '：' + (params.value || nanning  ) 
            }else if(params.name==='柳州市'){
               return params.name + '：' + (params.value || liuzhou  ) 
            }else if(params.name==='桂林市'){
               return params.name + '：' + (params.value || guiling  ) 
            }else if(params.name==='百色市'){
               return params.name + '：' + (params.value || baise  ) 
            }else if(params.name==='崇左市'){
               return params.name + '：' + (params.value || chongzuo  ) 
            }else if(params.name==='河池市'){
               return params.name + '：' + (params.value || hechi  ) 
            }else if(params.name==='玉林市'){
               return params.name + '：' + (params.value || yulin   ) 
            }else if(params.name==='梧州市'){
               return params.name + '：' + (params.value || wuzhou  ) 
            }else if(params.name==='来宾市'){
               return params.name + '：' + (params.value || laibing  ) 
            }else if(params.name==='钦州市'){
               return params.name + '：' + (params.value || qingzhou  ) 
            }else if(params.name==='贺州市'){
               return params.name + '：' + (params.value || hezhou  ) 
            }else if(params.name==='北海市'){
               return params.name + '：' + (params.value || beihai  ) 
           
           
            }else if(params.name==='成都市'){
               return params.name + '：' + (params.value || chengdu  ) 
            }else if(params.name==='绵阳市'){
               return params.name + '：' + (params.value || mianyang  ) 
            }else if(params.name==='自贡市'){
               return params.name + '：' + (params.value || zigong  ) 
            }else if(params.name==='德阳市'){
               return params.name + '：' + (params.value || deyang  ) 
            }else if(params.name==='雅安市'){
               return params.name + '：' + (params.value || yaan  ) 
            }else if(params.name==='凉山'){
               return params.name + '：' + (params.value || liangshan  ) 
            }else if(params.name==='泸州市'){
               return params.name + '：' + (params.value || luzhou ) 
            }else if(params.name==='南充市'){
               return params.name + '：' + (params.value || nanchong  ) 
            }else if(params.name==='内江市'){
               return params.name + '：' + (params.value || neijaing  ) 
            }else if(params.name==='宜宾市'){
               return params.name + '：' + (params.value || yibin  ) 
            }else if(params.name==='达州市'){
               return params.name + '：' + (params.value || dazhou  ) 
            }else if(params.name==='阿坝藏族羌族自治区'){
               return params.name + '：' + (params.value || aba  ) 
            }else if(params.name==='乐山市'){
               return params.name + '：' + (params.value || leshan  ) 
            }else if(params.name==='攀枝花市'){
               return params.name + '：' + (params.value || panshihua  ) 
            }else if(params.name==='甘孜'){
               return params.name + '：' + (params.value || ganzi  ) 
            }else if(params.name==='眉山市'){
               return params.name + '：' + (params.value || meishan  ) 
            }else if(params.name==='遂宁市'){
               return params.name + '：' + (params.value || suining  ) 
            }else if(params.name==='广安市'){
               return params.name + '：' + (params.value || guangan ) 
            }else if(params.name==='广元市'){
               return params.name + '：' + (params.value || guangyuan  ) 
            }else if(params.name==='巴中市'){
               return params.name + '：' + (params.value || bazhong  ) 
            
            
            }else if(params.name==='贵阳市'){
               return params.name + '：' + (params.value || guiyang  ) 
            }else if(params.name==='遵义市'){
               return params.name + '：' + (params.value || zunyi  ) 
            }else if(params.name==='铜仁市'){
               return params.name + '：' + (params.value || tongren  ) 
            }else if(params.name==='黔西南布依族'){
               return params.name + '：' + (params.value || qianxi )
            }else if(params.name==='安顺市'){
               return params.name + '：' + (params.value || anshan  ) 
            }else if(params.name==='毕节市'){
               return params.name + '：' + (params.value ||  bijie ) 
            }else if(params.name==='六盘水市'){
               return params.name + '：' + (params.value || liupanshui  ) 
               
               
            }else if(params.name==='湘潭市'){
               return params.name + '：' + (params.value ||  xiangtan ) 
            }else if(params.name==='湘西土家族苗族自治区'){
               return params.name + '：' + (params.value || xiangxi  ) 
            }else if(params.name==='长沙市'){
               return params.name + '：' + (params.value || changsha  ) 
            }else if(params.name==='岳阳市'){
               return params.name + '：' + (params.value ||  yueyang )
            }else if(params.name==='郴州市'){
               return params.name + '：' + (params.value ||  bingzhou ) 
            }else if(params.name==='衡阳市'){
               return params.name + '：' + (params.value || hengyang  ) 
            }else if(params.name==='邵阳市'){
               return params.name + '：' + (params.value || shaoyang  ) 
            }else if(params.name==='怀化市'){
               return params.name + '：' + (params.value || huaihua  )
            }else if(params.name==='常德市'){
               return params.name + '：' + (params.value || changde  ) 
            }else if(params.name==='永州市'){
               return params.name + '：' + (params.value || yongzhou  ) 
            }else if(params.name==='娄底市'){
               return params.name + '：' + (params.value || loudi  ) 
            }else if(params.name==='益阳市'){
               return params.name + '：' + (params.value || yiyang  )
            }else if(params.name==='株洲市'){
               return params.name + '：' + (params.value ||  zhuzhou ) 
            }else if(params.name==='张家界市'){
               return params.name + '：' + (params.value ||  zhangjiajie ) 
            
            
            }else if(params.name==='南昌市'){
               return params.name + '：' + (params.value || nanchang  ) 
            }else if(params.name==='抚州市'){
               return params.name + '：' + (params.value || fuzhou1  )            
            }else if(params.name==='赣州市'){
               return params.name + '：' + (params.value || gongzhou  ) 
            }else if(params.name==='景德镇市'){
               return params.name + '：' + (params.value ||  jingdezheng )            
            }else if(params.name==='上饶市'){
               return params.name + '：' + (params.value ||  shangrao ) 
            }else if(params.name==='宜春市'){
               return params.name + '：' + (params.value || yichun1  )            
            }else if(params.name==='吉安市'){
               return params.name + '：' + (params.value || jian  ) 
            }else if(params.name==='萍乡市'){
               return params.name + '：' + (params.value || pingxiang  )            
            }else if(params.name==='新余市'){
               return params.name + '：' + (params.value || xinyu  ) 
            }else if(params.name==='九江市'){
               return params.name + '：' + (params.value ||  jiujiang )            
           

               
            }else if(params.name==='武汉市'){
               return params.name + '：' + (params.value || wuhan  ) 
            }else if(params.name==='荆州市'){
               return params.name + '：' + (params.value || jingzhou1  )            
            }else if(params.name==='荆门市'){
               return params.name + '：' + (params.value || jingmeng  ) 
            }else if(params.name==='黄石市'){
               return params.name + '：' + (params.value || huangshi  )            
            }else if(params.name==='黄冈市'){
               return params.name + '：' + (params.value || huanggang  ) 
            }else if(params.name==='恩施土家苗族自治区'){
               return params.name + '：' + (params.value || enshi  )            
            }else if(params.name==='襄阳市'){
               return params.name + '：' + (params.value || xiangyang  ) 
            }else if(params.name==='十堰市'){
               return params.name + '：' + (params.value || shiyan  )            
            }else if(params.name==='孝感市'){
               return params.name + '：' + (params.value || xiaogan  ) 
            }else if(params.name==='咸宁市'){
               return params.name + '：' + (params.value || xiannig  )            
            }else if(params.name==='宜昌市'){
               return params.name + '：' + (params.value || yichang  ) 
            }else if(params.name==='仙桃市'){
               return params.name + '：' + (params.value ||  xiantao )            
            }else if(params.name==='随州市'){
               return params.name + '：' + (params.value || suizhou  ) 
            }else if(params.name==='鄂州市'){
               return params.name + '：' + (params.value || ezhou  )            
            
               
            }else if(params.name==='郑州市'){
               return params.name + '：' + (params.value ||  zhengzhou ) 
            }else if(params.name==='焦作市'){
               return params.name + '：' + (params.value || jiaozuo  )            
            }else if(params.name==='洛阳市'){
               return params.name + '：' + (params.value || luoyang  ) 
            }else if(params.name==='濮阳市'){
               return params.name + '：' + (params.value || puyang  )            
            }else if(params.name==='鹤壁市'){
               return params.name + '：' + (params.value || hebi  ) 
            }else if(params.name==='安阳市'){
               return params.name + '：' + (params.value || anyang  )            
            }else if(params.name==='三门峡市'){
               return params.name + '：' + (params.value || sanmengxia  ) 
            }else if(params.name==='南阳市'){
               return params.name + '：' + (params.value || nanyang  )            
            }else if(params.name==='驻马店市'){
               return params.name + '：' + (params.value || zhumadian  ) 
            }else if(params.name==='信阳市'){
               return params.name + '：' + (params.value || xinyang  )            
            }else if(params.name==='漯河市'){
               return params.name + '：' + (params.value || luohe  ) 
            }else if(params.name==='周口市'){
               return params.name + '：' + (params.value || zhoukou  )            
            }else if(params.name==='许昌市'){
               return params.name + '：' + (params.value ||  xuchang ) 
            }else if(params.name==='开封市'){
               return params.name + '：' + (params.value ||  kaifeng )            
            }else if(params.name==='新乡市'){
               return params.name + '：' + (params.value ||  xinxiang ) 
            }else if(params.name==='平顶山市'){
               return params.name + '：' + (params.value || pingdingshan  )            
          
        
            }else if(params.name==='海淀区'){
               return params.name + '：' + (params.value || haidianqu ) 
            }else if(params.name==='朝阳区'){
               return params.name + '：' + (params.value || zhaoyangqu  ) 
            }else if(params.name==='昌平区'){
               return params.name + '：' + (params.value || changpingqu  ) 
            }else if(params.name==='石景山区'){
               return params.name + '：' + (params.value || shijingshanqu )
            }else if(params.name==='房山区'){
               return params.name + '：' + (params.value || fangshanqu  ) 
            }else if(params.name==='大兴区'){
               return params.name + '：' + (params.value ||  daxingqu ) 
            }else if(params.name==='西城区'){
               return params.name + '：' + (params.value || xichengqu)
            }else if(params.name==='丰台区'){
               return params.name + '：' + (params.value || fengtaiqu  ) 
            }else if(params.name==='东城区'){
               return params.name + '：' + (params.value || dongchengqu  ) 
            }else if(params.name==='通州区'){
               return params.name + '：' + (params.value || tongzhouqu  ) 
            }else if(params.name==='延庆区'){
               return params.name + '：' + (params.value || yanqingqu )
            }else if(params.name==='密云区'){
               return params.name + '：' + (params.value || miyunqu  ) 
            }else if(params.name==='怀柔区'){
               return params.name + '：' + (params.value ||  huairouqu ) 
            }else if(params.name==='顺义区'){
               return params.name + '：' + (params.value || shunyiqu)
            
        
            }else if(params.name==='高新区'){
               return params.name + '：' + (params.value || gaoxinqu ) 
            }else if(params.name==='沙坪坝区'){
               return params.name + '：' + (params.value || shapingbaqu  ) 
            }else if(params.name==='南岸区'){
               return params.name + '：' + (params.value || nananqu  ) 
            }else if(params.name==='九龙坡区'){
               return params.name + '：' + (params.value || jiulongpuqu )
            }else if(params.name==='北碚区'){
               return params.name + '：' + (params.value || beipeiqu  ) 
            }else if(params.name==='巴南区'){
               return params.name + '：' + (params.value ||  bananqu ) 
            }else if(params.name==='渝北区'){
               return params.name + '：' + (params.value || yubeiqu)
            }else if(params.name==='渝中区'){
               return params.name + '：' + (params.value || yuzhongqu  ) 
            }else if(params.name==='万州区'){
               return params.name + '：' + (params.value || wanzhouqu  ) 
            }else if(params.name==='江津市'){
               return params.name + '：' + (params.value || jiangjing  ) 
            }else if(params.name==='永川市'){
               return params.name + '：' + (params.value || yongchuan  )
        
               
            }else if(params.name==='河西区'){
               return params.name + '：' + (params.value || hexiqu  ) 
            }else if(params.name==='河东区'){
               return params.name + '：' + (params.value || hedongqu  ) 
            }else if(params.name==='南开区'){
               return params.name + '：' + (params.value || nankaiqu  ) 
            }else if(params.name==='北辰区'){
               return params.name + '：' + (params.value || beichegnqu  ) 
            }else if(params.name==='武清区'){
               return params.name + '：' + (params.value || wuqingqu  ) 
            }else if(params.name==='津南区'){
               return params.name + '：' + (params.value || jingnanqu  )  
            }else if(params.name==='宝坻区'){
               return params.name + '：' + (params.value || baodiqu  ) 
            }else if(params.name==='滨海新区'){
               return params.name + '：' + (params.value || binghaixqu  ) 
            }else if(params.name==='东丽区'){
               return params.name + '：' + (params.value || dongliqu  )
            }



            return params.name + '：' + (params.value || '暂无大学信息')
          }
        },
        legend: {
          orient: 'vertical',
          top: '9%',
          left: '5%',
          icon: 'circle',
          data: [],
          selectedMode: 'single',
          selected: {},
          itemWidth: 12,
          itemHeight: 12,
          itemGap: 30,
          inactiveColor: '#b6d7ff',
          textStyle: {
            color: '#ec808d',
            fontSize: 14,
            fontWeight: 300,
            padding: [0, 0, 0, 15]
          }
        },
        visualMap: {
          min: 0,
          max: 200,
          left: 'left',
          top: 'bottom',
          text: ['高', '低'], // 取值范围的文字
          inRange: {
            color: ['#e0ffff', 'blue'] // 取值范围的颜色
          },
          show: true // 图注
        },
        geo: {
          map: '',
          roam: true, // 不开启缩放和平移
          zoom: 0.9, // 视角缩放比例
          label: {
            normal: {
              show: true,
              fontSize: 9,
              color: '#000'
            },
            emphasis: {
              show: true,
              color: 'blue',
            }
          },
          itemStyle: {
            normal: {
              borderColor: 'rgba(0, 0, 0, 0.2)'
            },
            emphasis: {
              areaColor: 'skyblue', // 鼠标选择区域颜色
              shadowOffsetX: 0,
              shadowOffsetY: 0,
              shadowBlur: 20,
              borderWidth: 0,
              shadowColor: 'rgba(0, 0, 0, 0.5)'
            }
          },
          left: '5%',
          right: '5%',
          top: '5%',
          bottom: '5%'
        },
        series: [
          {
            // name: '省份数据',
            type: 'map',
            geoIndex: 0, // 不可缺少，否则无tooltip 指示效果
            data:[]
          }
        ],
        provinceJSON: {},
        provinceName: ''
      }
    }
  },
  mounted () {
    this.initDate();
    this.resizeListener();
  },
  methods: {
    initDate(){
      const provinceName = this.$route.query.provinceName
      const province = this.$route.query.province
      this.provinceName = provinceName
      this.provinceJSON = require('../../utils/省份数据/json(省份)/' + provinceName)
      this.option.title.text = province;
      this.option.geo.map = province
      this.echartObj = this.$echarts.init(document.getElementById(this.id))
      this.$echarts.registerMap(province, this.provinceJSON)
      this.echartObj.setOption(this.option);
      this.echartObj.on("click", (params) => {
        if(params.name === "浦东新区" || 
        params.name === "崇明县" || 
        params.name === "金山区" || 
        params.name === "奉贤区" || 
        params.name === "松江区" || 
        params.name === "青浦区" || 
        params.name === "嘉定区" || 
        params.name === "宝山区" || 
        params.name === "闵行区" || 
        params.name === "徐汇区" || 
        params.name === "长宁区" || 
        params.name === "普陀区" || 
        params.name === "静安区" || 
        params.name === "黄浦区" || 
        params.name === "虹口区" || 
        params.name === "杨浦区" || 
        params.name === "闸北区"){
          
        }else {
        this.$router.push({
          path: "/city",
          query: { city: params.name 
          },
        });}
      });
    },
    resizeListener(){
      window.addEventListener('resize', () => {
        if (this.echartObj && this.echartObj.resize) {
          this.echartObj.resize()
        }
      })
    },
    goBack () {
      this.$router.go(-1)
    },
  }
}
</script>
<style lang="css">
.provinceCharts {
  height: 700px;
  width: 1000px;
  margin: auto;
}
.back {
  margin-left: 85%;
}
</style>
